
const text1 = ` 
Данил  - Python разработчик



Стаж работы — 4 года 3 месяца



Навыки

Языки разработки

Python, SQL

Языки разметки

HTML, CSS

Операционные системы

Linux, Windows

Фреймворки и библиотеки

Django, Django REST framework, aiogram, FastAPI, Flask, Asyncio, aiohttp,SQLalchemy, Celery, Redis, pytest, Unittest, Gunicorn, Kafka, Swagger, ElasticSearch, uvicorn

СУБД

PostgreSQL

Другие технологии

Nginx, ORM, CI/CD, Docker, Gunicorn, Celery, Redis, Kafka, alembic, Keycloak, Elasticsearch, Kibana, apm-server, Sentry, https,GitLab, VKCloud, SQLalchemy, ООП, Интеграционное тестирование, Мок-объекты, GraphQL



Опыт:

Проект «Маркетплейс» (сентябрь 2023 – по настоящее время)

Роль в проекте

Backend-разработчик

Цель проекта:

Разработка маркетплейса медицинских препаратов, биологически активных добавок (БАД) и сопутствующих товаров. Данный сервис позволяет пользователям заказывать нерецептурные препараты, получать их полное описание, а также пользоваться другими услугами.

Архитектура

Микросервисная.

Backend – FastAPI, DRF.

БД – PostgreSQL.

Обязанности/Функции:



Backend-разработка.

Интеграция микросервисов.

Проведение код-ревью.

Оптимизация производительности и устранение узких мест.

Взаимодействие в кросс-функциональной команде.



Непосредственные задачи



Реализовал ноувю интеграцию в рамках MVP схемы Ozon Api Logistic Platform;

Реализовал интеграции между микросервисами;

Реализовывал новый функционал системы;

Проводил обработку ошибок API;

Выполнял code review backend-части;

Выполнял тестирование кода с помощью pytest;

Писал и тестировал миграции БД;

Писал сопровождающую техническую документацию.



Состав команды

1 PM, 2 UX/UI дизайнера, 2 frontend, 4 backend, 1 QA, 1 DevOps

Применяемые технологии

FastAPI, Redis, pytest, SQLAlchemy, Kafka, PostgreSQL, nginx, docker, alembic, Keycloak, Elasticsearch, Kibana, apm-server



Проект «LMS – платформа для обучения» (август 2022 – декабрь 2023)

Роль в проекте

Backend-разработчик

Цели проекта:

Разработка современной образовательной платформы для студентов, профессионалов и всех, кто стремится к саморазвитию в различных сферах. Платформа предлагает удобный интерфейс для выбора, оплаты и прохождения учебных курсов, а также оценки полученных знаний.

Архитектура

Микросервисная

Бэкенд на Django и Django REST framework

БД PostgreSQL

Обязанности/Функции:



Backend-разработка.

Анализ требований к проекту, участие в проектировании архитектуры и БД.

Взаимодействие с командой.

Добавление нового функционала.

Исправление ошибок, написание модульных и интеграционных тестов.

Участие в развитии продукта и процессов вместе с командой.



Непосредственные задачи



Участвовал в построении архитектуры проекта, выборе технологий разработки и организации взаимодействия между компонентами;

Участвовал в разработке схем по декомпозиции бизнес-логики приложения;

Разработал RESTful API. Обеспечил эффективные и безопасные методы для работы с данными;

Совместно с командой спроектировали и оптимизировали структуру базы данных для хранения информации о пользователях, курсах, оценках и других сущностях;

Создал объектные модели данных и написал CRUD для представления сущностей, таких как пользователи, курсы, оценки и др.;

Разработал ролевые модели и написал для них CRUD;

Писал юнит-тесты для проверки корректности работы отдельных компонентов и функций системы, чем обеспечил надежность и стабильность кода;

Создавал описание технической документации по коду;

Участвовал в проведении регулярных демонстраций нового функционала и прогресса разработки заказчику.



Состав команды

1 PM, 1 SA, 1 UX/UI дизайнер, 2 frontend, 6 backend, 1 QA, 1 DevOps

Применяемые технологии

Django, DRF, Celery, Swagger, Redis, unittest, PostgreSQL



Проект «Сервисы B2B» (ноябрь 2021 – июль 2022)

Роль в проекте

Backend-разработчик

Цели проекта:

Создание комплекса корпоративных B2B сервисов для организаций, которые помогут улучшить управление товарами, поиск информации и работу с ценовыми данными. Сервисы разработаны с целью оптимизации бизнес-процессов и повышения эффективности работы с товарными каталогами.

Архитектура

Бэкенд на Django и Django REST framework

БД PostgreSQL

Обязанности/Функции:

Backend-разработка.

Анализ требований к проекту.

Улучшение и оптимизация кодовой базы.

Проведение code-review, анализ и исправление ошибок.

Участие в развитии продукта и процессов вместе с командой.

Непосредственные задачи



Реализовал парсер для загрузки номенклатур в каталог товаров из файлов формата Excel; 

Внедрил обёртки в виде Celery-задачи для оптимизации обработки данных;

Внедрил и работал с ElasticSearch для расширения поиска по каталогу товаров; 

Реализовал механизмы диагностики и оптимизации процессов индексации и поиска;

Активно участвовал в поддержке существующего легаси кода в большом объеме. Вносил изменения, улучшил читаемость и производительность кодовой базы;

Разработал механизм конвертации цен в каталоге товаров в различные валюты. Обеспечил актуальность цен в условиях многовалютной среды;  

Покрыл код тестами для выявления и предотвращения возможных проблем;

Определил и реализовал архитектуру сервиса уведомлений, позволяющего эффективно информировать пользователей о важных изменениях в каталоге и системе.



Состав команды

1 TeamLead, 4 backend, 2 frontend, 1 QA, 1 PM, 1 BA

Применяемые технологии

PostgresSQL, Django, DRF, ElasticSearch, Redis, Celery, Sentry, Docker, https



Проект «Портал компаний спортивного сообщества» (ноябрь 2020 - октябрь 2021)

Роль в проекте

Backend-разработчик

Цели проекта:

Разработка проекта с целью объединения различных спортивных медиа-проектов под единой структурой базы данных и REST API. Портал предлагает функционал для работы с турнирами, отображения баннерной рекламы и автоматического формирования и обновления турнирных таблиц на основе внесенных результатов матчей.

Архитектура

Бэкенд на Django и Django REST framework

БД PostgreSQL

Обязанности/Функции:



Backend-разработка.

Разработка REST API, написание CRUD.

Анализ требований к проекту.

Взаимодействие с командой. Проведение релизов, участие в дейли и ретроспективах.

Проведение code-review, анализ и исправление ошибок.

Участие в развитии продукта и процессов вместе с командой.



Непосредственные задачи



Создал переиспользуемое приложение на базе фреймворка Django, определившее общую структуру базы данных, с использованием Django ORM; 

Разработал общее REST API с помощью Django rest framework для обеспечения взаимодействия с несколькими медиа-проектами;

Спроектировал и интегрировал систему управления баннерной рекламой. Разработал механизмы отображения баннеров на основе контекста и пользовательского поведения;  

Разработал автоматизированную систему, которая автоматически формирует и обновляет турнирные таблицы на основе результатов матчей, добавляемых в базу данных;

Писал модульные и интеграционные тесты для проверки корректности работы отдельных компонентов и функций системы;

Создавал описание технической документации по коду.



Состав команды

3 backend, 1 frontend, 1 QA, 1 PM, 1 BA

Применяемые технологии

Django, Django REST framework, PostgresSQL, Nginx, Docker, pytest, Django ORM



Проект «Сайт» (апрель 2020 - октябрь 2020)

Роль в проекте

Backend-разработчик

Цели проекта:

Разработка сайта маркетплейса. Были реализованы две основные роли: поставщик и покупатель. Покупатель имеет возможность выбрать необходимые товары, добавить их в корзину и оформить заказ. После этого заказ проходит через несколько этапов: модерация, согласование, утверждение, поступление на склад и т.д. В конечном итоге покупатель получает товар, а поставщик – оплату.

Архитектура

Бэкенд на FastAPI

БД PostgreSQL

Обязанности/Функции:



Backend-разработка.

Разработка API, написание CRUD.

Написание новых фич.

Доработка и рефакторинг кода.

Проведение code-review, анализ и исправление ошибок.

Участие в развитии продукта и процессов вместе с командой.



Непосредственные задачи



Разработал систему доступа к эндопойнтам в соответствии с ролевой моделью.

Развернул GitLab в VKCloud.

Обработал и исправил множество багов.

Покрыл свой и чужой код тестами.

Написал пайплайны тестирования приложения.

Отрефакторил код.



Состав команды

1 PM, 2 backend, 1 frontend,  1 UX/UI дизайнер, 1 QA

Применяемые технологии

FastAPI, uvicorn, GitLab, GitLab ci-cd, VKCloud, pytest, sqlalchemy, redis, Docker

*Указан не весь опыт кандидата



Иностранные языки

English

Reading

Writing

Communication

Intermediate

Intermediate

Intermediate

О специалисте

Пришел в IT по зову сердца, так как всегда интересовался тем, как работают сложные системы на уровне кода и его логики. Мои сильные качества: пунктуальность, способность быстро осваивать новые технологии, высокая стрессоустойчивость.

Я ищу работу в проекте, где четко налажены все бизнес-процессы и распределена ответственность между различными командами (разработка, аналитика – очень важно, чтобы она была, тестирование). Сфера проекта для меня не является ключевым фактором, я готов погрузиться в любой процесс, так как везде есть свои интересные задачи.

Образование/Локация - по запросу

`
const res1 = {
    "name": "Данил",
    "position": "Python разработчик",
    "grade": "Middle+",
    "age": null,
    "experience": "4 года 3 месяца",
    "location": null,
    "technologies": [
      "Django",
      "Django REST framework",
      "Flask",
      "FastAPI",
      "aiogram",
      "Asyncio",
      "aiohttp",
      "SQLalchemy",
      "Celery",
      "Redis",
      "pytest",
      "Unittest",
      "Gunicorn",
      "Kafka",
      "Swagger",
      "ElasticSearch",
      "uvicorn",
      "Docker",
      "Nginx",
      "CI/CD",
      "SQLalchemy",
      "GraphQL"
    ],
    "databases": [
      "PostgreSQL"
    ],
    "operatingSystems": [
      "Linux",
      "Windows"
    ],
    "webTechnologies": [
      "HTML",
      "CSS"
    ],
    "devTools": [
      "GitLab",
      "VKCloud",
      "Keycloak",
      "Sentry",
      "apm-server",
      "Kibana",
      "alembic"
    ],
    "programmingLanguages": [
      "Python",
      "SQL"
    ],
    "languages": [
      {
        "level": "Intermediate",
        "name": "English"
      }
    ],
    "personalInfo": {
      "gender": null,
      "birthday": null,
      "citizenship": null,
      "workPermit": null,
      "relocation": null,
      "businessTrips": null
    },
    "education": {
      "level": null,
      "year": null,
      "institution": null,
      "specialization": null
    },
    "certificates": [],
    "courses": [],
    "projects": [
      {
        "name": "Маркетплейс",
        "description": "Разработка маркетплейса медицинских препаратов, биологически активных добавок (БАД) и сопутствующих товаров. Данный сервис позволяет пользователям заказывать нерецептурные препараты, получать их полное описание, а также пользоваться другими услугами.",
        "duration": "09.2023 – по настоящее время",
        "role": "Backend-разработчик",
        "duties": [
          "Backend-разработка.",
          "Интеграция микросервисов.",
          "Проведение код-ревью.",
          "Оптимизация производительности",
          "Устранение узких мест",
          "Работа в кросс-функциональной команде",
          "Реализовал ноувю интеграцию в рамках MVP схемы Ozon Api Logistic Platform",
          "Реализовал интеграции между микросервисами",
          "Реализовывал новый функционал системы",
          "Проводил обработку ошибок API",
          "Выполнял code review backend-части",
          "Выполнял тестирование кода с помощью pytest",
          "Писал и тестировал миграции БД",
          "Писал сопровождающую техническую документацию",
        ],
        "technologiesUsed": [
          "FastAPI",
          "Redis",
          "pytest",
          "SQLAlchemy",
          "Kafka",
          "PostgreSQL",
          "nginx",
          "docker",
          "alembic",
          "Keycloak",
          "Elasticsearch",
          "Kibana",
          "apm-server",
          "микросервисная архитектура"
        ]
      },
      {
        "name": "LMS – платформа для обучения",
        "description": "Разработка современной образовательной платформы для студентов, профессионалов и всех, кто стремится к саморазвитию в различных сферах. Платформа предлагает удобный интерфейс для выбора, оплаты и прохождения учебных курсов, а также оценки полученных знаний.",
        "duration": "08.2022 – 12.2023 (1 год)",
        "role": "Backend-разработчик",
        "duties": [
          "Backend-разработка.",
          "Анализ требований",
          "Участие в проектировании архитектуры и БД",
          "Добавление нового функционала",
          "Исправление ошибок",
          "Написание модульных и интеграционных тестов",
          "Участие в развитии продукта",
          "Участвовал в построении архитектуры проекта, выборе технологий разработки и организации взаимодействия между компонентами",
          "Участвовал в разработке схем по декомпозиции бизнес-логики приложения",
          "Разработал RESTful API. Обеспечил эффективные и безопасные методы для работы с данными",
          "Совместно с командой спроектировали и оптимизировали структуру базы данных для хранения информации о пользователях, курсах, оценках и других сущностях",
          "Создал объектные модели данных и написал CRUD для представления сущностей, таких как пользователи, курсы, оценки и др.",
          "Разработал ролевые модели и написал для них CRUD",
          "Писал юнит-тесты для проверки корректности работы отдельных компонентов и функций системы, чем обеспечил надежность и стабильность кода",
          "Создавал описание технической документации по коду",
          "Участвовал в проведении регулярных демонстраций нового функционала и прогресса разработки заказчику",
        ],
        "technologiesUsed": [
          "Django",
          "DRF",
          "Celery",
          "Swagger",
          "Redis",
          "unittest",
          "PostgreSQL",
          "микросервисная архитектура",
        ]
      },
      {
        "name": "Сервисы B2B",
        "description": "Создание комплекса корпоративных B2B сервисов для организаций, которые помогут улучшить управление товарами, поиск информации и работу с ценовыми данными. Сервисы разработаны с целью оптимизации бизнес-процессов и повышения эффективности работы с товарными каталогами.",
        "duration": "11.2021 – 07.2022 (8 месяцев)",
        "role": "Backend-разработчик",
        "duties": [
          "Backend-разработка.",
          "Анализ требований к проекту.",
          "Улучшение и оптимизация кода",
          "Проведение code-review",
          "Участие в развитии продукта",
          "Реализовал парсер для загрузки номенклатур в каталог товаров из файлов формата Excel",
          "Внедрил обёртки в виде Celery-задачи для оптимизации обработки данных",
          "Внедрил и работал с ElasticSearch для расширения поиска по каталогу товаров",
          "Реализовал механизмы диагностики и оптимизации процессов индексации и поиска",
          "Активно участвовал в поддержке существующего легаси кода в большом объеме. Вносил изменения, улучшил читаемость и производительность кодовой базы",
          "Разработал механизм конвертации цен в каталоге товаров в различные валюты. Обеспечил актуальность цен в условиях многовалютной среды",
          "Покрыл код тестами для выявления и предотвращения возможных проблем",
          "Определил и реализовал архитектуру сервиса уведомлений, позволяющего эффективно информировать пользователей о важных изменениях в каталоге и системе",
        ],
        "technologiesUsed": [
          "PostgresSQL",
          "Django",
          "DRF",
          "ElasticSearch",
          "Redis",
          "Celery",
          "Sentry",
          "Docker",
          "https"
        ]
      },
      {
        "name": "Портал компаний спортивного сообщества",
        "description": "Разработка проекта с целью объединения различных спортивных медиа-проектов под единой структурой базы данных и REST API. Портал предлагает функционал для работы с турнирами, отображения баннерной рекламы и автоматического формирования и обновления турнирных таблиц на основе внесенных результатов матчей.",
        "duration": "11.2020 – 10.2021 (1 год)",
        "role": "Backend-разработчик",
        "duties": [
          "Backend-разработка.",
          "Разработка REST API",
          "Анализ требований",
          "Взаимодействие с командой",
          "Проведение code-review",
          "Участие в развитии продукта",
          "Создал переиспользуемое приложение на базе фреймворка Django, определившее общую структуру базы данных, с использованием Django ORM",
          "Разработал общее REST API с помощью Django rest framework для обеспечения взаимодействия с несколькими медиа-проектами",
          "Спроектировал и интегрировал систему управления баннерной рекламой. Разработал механизмы отображения баннеров на основе контекста и пользовательского поведения",
          "Разработал автоматизированную систему, которая автоматически формирует и обновляет турнирные таблицы на основе результатов матчей, добавляемых в базу данных",
          "Писал модульные и интеграционные тесты для проверки корректности работы отдельных компонентов и функций системы",
          "Создавал описание технической документации по коду",
        ],
        "technologiesUsed": [
          "Django",
          "Django REST framework",
          "PostgresSQL",
          "Nginx",
          "Docker",
          "pytest",
          "Django ORM"
        ]
      },
      {
        "name": "Сайт",
        "description": "Разработка сайта маркетплейса. Были реализованы две основные роли: поставщик и покупатель. Покупатель имеет возможность выбрать необходимые товары, добавить их в корзину и оформить заказ. После этого заказ проходит через несколько этапов: модерация, согласование, утверждение, поступление на склад и т.д. В конечном итоге покупатель получает товар, а поставщик – оплату",
        "duration": "04.2020 – 10.2020",
        "role": "Backend-разработчик",
        "duties": [
          "Backend-разработка.",
          "Разработка API",
          "Написание новых фич.",
          "Доработка и рефакторинг кода",
          "Проведение code-review",
          "Участие в развитии продукта",
          "Разработал систему доступа к эндопойнтам в соответствии с ролевой моделью",
          "Развернул GitLab в VKCloud",
          "Обработал и исправил множество багов",
          "Покрыл свой и чужой код тестами",
          "Написал пайплайны тестирования приложения",
          "Отрефакторил код",
        ],
        "technologiesUsed": [
          "FastAPI",
          "uvicorn",
          "GitLab",
          "GitLab ci-cd",
          "VKCloud",
          "pytest",
          "sqlalchemy",
          "redis",
          "Docker"
        ]
      }
    ]
  }