const test10 = ` 

ЖЕРЕБИЛОВ ИВАН

QA-ИНЖЕНЕР	

Фулстек-инженер с 10-ти летним опытом тестирования фронтенда (включая мобильные приложения) и бэкенда (приложения на микросервисной и монолитной архитектурах). Имею опыт в функциональном, регрессионном, интеграционном и других видах тестирования. На одном из проектов тестировал систему поиска. Большой опыт автоматизации на Java с применением Apache Maven, Selenium/Selenide, Cypress, JUnit5, Rest Assured и Spring Boot. 





НАВЫКИ

Java 8,11,17, Selenium, Selenide, REST API, JSON, CI/CD, Jenkins, SQL, PostgerSQL, noSQL (MongoDB), JUnit 5, Spring Boot 3, Kubernetes, TestRail, Allure TestOps, Gradle, TestNG, Apache Maven, Kafka, RabbitMQ, SoapUI, Cypress, Charles Proxy, Appium, Fiddler Atlassian Jira, Trello, YouTrack, RedMine, Atlassian Confluence, Postman, Git, Scrum, Test case, Check-list, Bug Reporting, Swagger, Intellij IDEA, Kanban, Agile Project Management, HTTP, XML, XSD, Linux, ООП, Mobile/Web, UI/UX тестирование, Регрессионное, Функциональное, Интеграционное тестирование, тестирование поисковых систем, теория тестирования, техники тест-дизайна.



ОБРАЗОВАНИЕ И ЯЗЫКИ

Кубанский государственный университет, Краснодар, 2017

Филологический, Русская литература (Магистр).

Кубанский государственный университет, Краснодар, 2015

Филологический, Русская литература (Бакалавр).

Иностранный язык

English language (intermediate).



ОПЫТ РАБОТЫ: 10 ЛЕТ

NDA (Разработка программного обеспечения)

QA-инженер

Проект:

Июнь 2021  / Наст. время

Разработка инструмента для создания чертежей плана квартиры и тестирование всей необходимой документации для проекта квартиры (планы, стилевые решения, ведомости).

Обязанности:

Самостоятельное определение стратегии тестирования;

Самостоятельный выбор инструментов тестирования;

Написание тестовой документации (чек-листы, тест-кейсы, баг репорты, отчеты о тестировании) «с нуля» в Allure TestOps;

Тестирование поисковых систем: поиск заказа по номеру, поиск заказа по части номера, проверка регистров, формата данных, языков поиска;

Налаживание процессов тестирования;

Написание Postman-коллекций, для ручного тестирования API;

Работа с брокерами сообщений Kafka, RabbitMQ;

Работа с системами CI/CD на уровне пользователя (запуск готовых джобов, понимание основных этапов типового пайплайна);

Написание UI автотестов  Java 11, Selenide, Junit5, Gradle, Allure;

Работа с БД на уровне SQL средней сложности/сложными запросами (CRUD, Join, View, подзапросы, агрегатные функции);

Выполнение регрессионного тестирования, smoke-тестирования, санитарного тестирования, интеграционного тестирования;

Взаимодействие с командой на всех этапах разработки продукта;

Работа с Linux: работа в консоли, общие пользовательские команды (работа с файлами, процессами, ресурсами, Bash-скрипты);

Участие в планировании спринтов и релизов.

Технологии:

Agile, Scrum, Java 11, Spring Boot 3, Selenide, Postman, Kafka, RabbitMQ, Jenkins, Charles Proxy, DevTools,  Jira, Confluence, Adminer, PostgerSQL, API, HTTP, REST, JSON, ООП, Linux, GIT.



FinFort (Разработка программного обеспечения)

QA lead

Проект:

Январь 2020 / Июнь 2021

Тестировал несколько проектов:

Финансовый проект – агрегатор различных финансовых инструментов: страховые, кредитные карты и прочее;

Агрегатор наличия скидок на разных маркетплейсах.  

Обязанности:

Формирование команды тестирования, команда QA 5 человек;

Менторская работа с новыми сотрудниками команды QA;

Распределение задач в команде QA;

Ведение тестовой документации чек-листы, тест-кейсы, тест-планы в TestRail;

Написание Postman-коллекций, для ручного тестирования API;

Работа с MongoDB;

Написание автоматизированных тестов на Postman;

Написание автоматизированных тестов на Cypress;

Проведение интеграционного тестирования;

Подготовка тестовых сценариев для регрессионного тестирования;

Проведение регрессионного тестирования;

Составление отчётов по итогу регрессионного тестирования;

Участие в планировании спринтов и релизов;

Определение трудозатрат на тестирование;

Работа с Linux: работа в консоли, общие пользовательские команды;

Взаимодействие с командой на всех этапах разработки.

Технологии:

Agile, Scrum, Kanban, Cypress, Postman, Swagger, Charles Proxy, TestRail, YouTrack, Adminer, PostgerSQL, MongoDB, API, HTTP, REST, JSON, ООП, Linux, GIT.



DigitalWorld (Ритейл)

QA lead

Проект:

Апрель 2019 / Январь 2020

Тестировал агрегатор продуктов питания для разных поставщиков и немного затронул тестирование проекта по криптобирже.

Обязанности:

Взаимодействие с командой разработчиков на всех этапах процесса разработки;

Написание тестовой документации (чек-листы, тест-кейсы, отчёты);

Распределение задач в команде;

Оценка задач на тестирование;

Проведение технических собеседований;

Работа с тех. документацией;

Автоматизированное тестирование API (Rest Assured);

Автоматизированное тестирование UI.

Технологии:

Java 17, Postman, Rest Assured, API, Selenium, Jira, Confluence, ООП.



S Media Link (Разработка программного обеспечения)

Middle QA Engineer/QA lead

Проект:

Ноябрь 2017 / Апрель 2019

Тестировал мобильное и веб-приложение.

Обязанности:

Взаимодействие с командой разработчиков на всех этапах процесса разработки;

Написание тестовой документации (чек-листы, тест-кейсы, отчёты);

Работа с тех. документацией;

Работа с системами CI/CD на уровне пользователя (запуск готовых джобов, понимание основных этапов типового пайплайна);

Автоматизированное тестирование UI (Selenium/Selenide, JUnit5, Java);

Автоматизированное тестирование API (Rest Assured).

Технологии:

Java 8, Selenium/Selenide, Spring Boot 3, JUnit5, Java Rest Assured, Jenkins, Appium, Postman, yandex-tank, ООП.



Fasten (Группа компаний "Везёт")

QA Engineer

Проект:

Февраль 2017 / Ноябрь 2017

Тестировал веб- и мобильное приложение на ios и android.

Обязанности:

Выполнение ручного тестирования UI;

Написание тестовой документации (тест-кейсы, чек-листы);

Проведение регрессионного тестирования;

Оформление баг-репортов (Jira);

Тестирование backend (выполнение Rest-запросов на Soap UI);

Мобильное тестирование (IOS, Android);

Просмотр логов в Kibana и Android Studio;

Работа в БД PostgreSQL (уровень простых запросов).

Технологии:

Jira, Confluence, REST, SOAP UI, Android  Studio, PostgreSQL, ООП.



AT Consulting (Разработка программного обеспечения, ИТ-консалтинг)

Junior QA

Проект:

Апрель 2015 / Февраль 2017

Десктопное приложение для МФЦ.

Обязанности:

Выполнение ручного тестирования UI;

Написание тестовой документации (тест-кейсы, чек-листы);

Проведение регрессионного тестирования;

Оформление баг-репортов (Jira);

Тестирование backend (выполнение Rest-запросов на Soap UI);

Мобильное тестирование (IOS, Android).

Технологии:

Jira, Confluence, ООП, REST, SOAP UI, Android  Studio.



`

const res10 = {
  "name": "Жеребилов Иван",
  "position": "QA-инженер",
  "grade": "Senior",
  "age": null,
  "experience": "10 лет",
  "location": null,
  "technologies": [
    "Java 8",
    "Java 11",
    "Java 17",
    "Selenium",
    "Selenide",
    "REST API",
    "JSON",
    "CI/CD",
    "Jenkins",
    "SQL",
    "PostgreSQL",
    "noSQL",
    "MongoDB",
    "JUnit 5",
    "Spring Boot 3",
    "Kubernetes",
    "TestRail",
    "Allure TestOps",
    "Gradle",
    "TestNG",
    "Apache Maven",
    "Kafka",
    "RabbitMQ",
    "SoapUI",
    "Cypress",
    "Charles Proxy",
    "Appium",
    "Fiddler",
    "Atlassian Jira",
    "Trello",
    "YouTrack",
    "RedMine",
    "Atlassian Confluence",
    "Postman",
    "Git",
    "Scrum",
    "Test case",
    "Check-list",
    "Bug Reporting",
    "Swagger",
    "Intellij IDEA",
    "Kanban",
    "Agile Project Management",
    "HTTP",
    "XML",
    "XSD",
    "Linux",
    "ООП",
    "Mobile/Web",
    "UI/UX тестирование",
    "Регрессионное",
    "Функциональное",
    "Интеграционное тестирование",
    "тестирование поисковых систем",
    "теория тестирования",
    "техники тест-дизайна"
  ],
  "databases": [
    "PostgreSQL",
    "MongoDB"
  ],
  "operatingSystems": [
    "Linux"
  ],
  "webTechnologies": [],
  "devTools": [
    "Postman",
    "Jenkins",
    "Charles Proxy",
    "DevTools"
  ],
  "programmingLanguages": [
    "Java"
  ],
  "languages": [
    {
      "level": "intermediate",
      "name": "English language"
    }
  ],
  "personalInfo": {
    "gender": null,
    "birthday": null,
    "citizenship": null,
    "workPermit": null,
    "relocation": null,
    "businessTrips": null
  },
  "education": [
    {
      "level": "Магистр",
      "year": 2017,
      "institution": "Кубанский государственный университет",
      "specialization": "Русская литература"
    },
    {
      "level": "Бакалавр",
      "year": 2015,
      "institution": "Кубанский государственный университет",
      "specialization": "Русская литература"
    }
  ],
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "NDA",
      "description": "Разработка инструмента для создания чертежей плана квартиры и тестирование всей необходимой документации для проекта квартиры (планы, стилевые решения, ведомости).",
      "duration": "06.2021 / Наст. время",
      "role": "QA-инженер",
      "duties": [
        "Самостоятельное определение стратегии тестирования",
        "Самостоятельный выбор инструментов тестирования",
        "Написание тестовой документации (чек-листы, тест-кейсы, баг репорты, отчеты о тестировании) «с нуля» в Allure TestOps",
        "Тестирование поисковых систем: поиск заказа по номеру, поиск заказа по части номера, проверка регистров, формата данных, языков поиска",
        "Налаживание процессов тестирования",
        "Написание Postman-коллекций, для ручного тестирования API",
        "Работа с брокерами сообщений Kafka, RabbitMQ",
        "Работа с системами CI/CD на уровне пользователя (запуск готовых джобов, понимание основных этапов типового пайплайна)",
        "Написание UI автотестов  Java 11, Selenide, Junit5, Gradle, Allure",
        "Работа с БД на уровне SQL средней сложности/сложными запросами (CRUD, Join, View, подзапросы, агрегатные функции)",
        "Выполнение регрессионного тестирования, smoke-тестирования, санитарного тестирования, интеграционного тестирования",
        "Взаимодействие с командой на всех этапах разработки продукта",
        "Работа с Linux: работа в консоли, общие пользовательские команды (работа с файлами, процессами, ресурсами, Bash-скрипты)",
        "Участие в планировании спринтов и релизов"
      ],
      "technologiesUsed": [
        "Agile",
        "Scrum",
        "Java 11",
        "Spring Boot 3",
        "Selenide",
        "Postman",
        "Kafka",
        "RabbitMQ",
        "Jenkins",
        "Charles Proxy",
        "DevTools",
        "Jira",
        "Confluence",
        "Adminer",
        "PostgreSQL",
        "API",
        "HTTP",
        "REST",
        "JSON",
        "ООП",
        "Linux",
        "GIT"
      ]
    },
    {
      "name": "FinFort",
      "description": "Тестировал несколько проектов: Финансовый проект – агрегатор различных финансовых инструментов и агрегатор наличия скидок на разных маркетплейсах.",
      "duration": "01.2020 / 06.2021",
      "role": "QA lead",
      "duties": [
        "Формирование команды тестирования, команда QA 5 человек",
        "Менторская работа с новыми сотрудниками команды QA",
        "Распределение задач в команде QA",
        "Ведение тестовой документации чек-листы, тест-кейсы, тест-планы в TestRail",
        "Написание Postman-коллекций, для ручного тестирования API",
        "Работа с MongoDB",
        "Написание автоматизированных тестов на Postman",
        "Написание автоматизированных тестов на Cypress",
        "Проведение интеграционного тестирования",
        "Подготовка тестовых сценариев для регрессионного тестирования",
        "Проведение регрессионного тестирования",
        "Составление отчётов по итогу регрессионного тестирования",
        "Участие в планировании спринтов и релизов",
        "Определение трудозатрат на тестирование",
        "Работа с Linux: работа в консоли, общие пользовательские команды",
        "Взаимодействие с командой на всех этапах разработки"
      ],
      "technologiesUsed": [
        "Agile",
        "Scrum",
        "Kanban",
        "Cypress",
        "Postman",
        "Swagger",
        "Charles Proxy",
        "TestRail",
        "YouTrack",
        "Adminer",
        "PostgreSQL",
        "MongoDB",
        "API",
        "HTTP",
        "REST",
        "JSON",
        "ООП",
        "Linux",
        "GIT"
      ]
    },
    {
      "name": "DigitalWorld",
      "description": "Тестировал агрегатор продуктов питания для разных поставщиков и немного затронул тестирование проекта по криптобирже.",
      "duration": "04.2019 / 01.2020",
      "role": "QA lead",
      "duties": [
        "Взаимодействие с командой разработчиков на всех этапах процесса разработки",
        "Написание тестовой документации (чек-листы, тест-кейсы, отчёты)",
        "Распределение задач в команде",
        "Оценка задач на тестирование",
        "Проведение технических собеседований",
        "Работа с тех. документацией",
        "Автоматизированное тестирование API (Rest Assured)",
        "Автоматизированное тестирование UI"
      ],
      "technologiesUsed": [
        "Java 17",
        "Postman",
        "Rest Assured",
        "API",
        "Selenium",
        "Jira",
        "Confluence",
        "ООП"
      ]
    },
    {
      "name": "S Media Link",
      "description": "Тестировал мобильное и веб-приложение.",
      "duration": "11.2017 / 04.2019",
      "role": "Middle QA Engineer/QA lead",
      "duties": [
        "Взаимодействие с командой разработчиков на всех этапах процесса разработки",
        "Написание тестовой документации (чек-листы, тест-кейсы, отчёты)",
        "Работа с тех. документацией",
        "Работа с системами CI/CD на уровне пользователя (запуск готовых джобов, понимание основных этапов типового пайплайна)",
        "Автоматизированное тестирование UI (Selenium/Selenide, JUnit5, Java)",
        "Автоматизированное тестирование API (Rest Assured)"
      ],
      "technologiesUsed": [
        "Java 8",
        "Selenium/Selenide",
        "Spring Boot 3",
        "JUnit5",
        "Java Rest Assured",
        "Jenkins",
        "Appium",
        "Postman",
        "yandex-tank",
        "ООП"
      ]
    },
    {
      "name": "Fasten",
      "description": "Тестировал веб- и мобильное приложение на ios и android.",
      "duration": "02.2017 / 11.2017",
      "role": "QA Engineer",
      "duties": [
        "Выполнение ручного тестирования UI",
        "Написание тестовой документации (тест-кейсы, чек-листы)",
        "Проведение регрессионного тестирования",
        "Оформление баг-репортов (Jira)",
        "Тестирование backend (выполнение Rest-запросов на Soap UI)",
        "Мобильное тестирование (IOS, Android)",
        "Просмотр логов в Kibana и Android Studio",
        "Работа в БД PostgreSQL (уровень простых запросов)"
      ],
      "technologiesUsed": [
        "Jira",
        "Confluence",
        "REST",
        "SOAP UI",
        "Android Studio",
        "PostgreSQL",
        "ООП"
      ]
    },
    {
      "name": "AT Consulting",
      "description": "Десктопное приложение для МФЦ.",
      "duration": "04.2015 / 02.2017",
      "role": "Junior QA",
      "duties": [
        "Выполнение ручного тестирования UI",
        "Написание тестовой документации (тест-кейсы, чек-листы)",
        "Проведение регрессионного тестирования",
        "Оформление баг-репортов (Jira)",
        "Тестирование backend (выполнение Rest-запросов на Soap UI)",
        "Мобильное тестирование (IOS, Android)"
      ],
      "technologiesUsed": [
        "Jira",
        "Confluence",
        "ООП",
        "REST",
        "SOAP UI",
        "Android Studio"
      ]
    }
  ]
}