const cv2 = `Александр Т.

AQA Engineer



Профильный стаж: 3 года 2 месяца



Профессиональные навыки: 

Виды тестирования: Функциональное, API, UI, E2E, кросс-браузерное, регрессионное, интеграционное,тестирование по методам черного и белого ящика

Тестирование API: Postman, Rest Assured, Insomnia

Тестирование UI: Selenide, Selenium, Playwright

Языки программирования: Java 17, Python

Фреймворки для тестирования: JUnit, TestNG, Pytest

Сборка и автоматизация: Gradle, Maven, Docker, Jenkins

Отчетность и логирование: Allure, Kibana

Базы данных и очереди сообщений: PostgreSQL, Kafka

Управление тестами и документацией: Allure TestOps, Confluence, Jira

Инструменты анализа: DevTools



Высшее образование: 

КНИТУ им. А.Н. Туполева-КАИ, Институт компьютерных технологий и защиты информации, Программная инженерия (2024)



Английский язык: B2



Гражданство: РФ

Проекты





Аутсорсинговая компания

Август 2023 — н.в. (1 год 7 месяцев)



Партнерские интеграции для крупнейшего частного банка России:

Проведение ручного функционального тестирования с анализом требований и составлением тест-кейсов;

Разработка и автоматизация тестов API на Java с использованием REST-assured;

Тестирование пользовательского интерфейса с использованием Selenide: проверка верстки, функционала и взаимодействия с элементами;

Разработка тестового фреймворка с нуля на Java, используя Selenide, JUnit/TestNG, Gradle и Allure;

Анализ логов и мониторинг ошибок с помощью Kibana;

Составление тестовой документации: тест-кейсы, чек-листы, баг-репорты, отчёты о тестировании; 

Составление тестовой модели в TestOps.



Стек: Postman, DevTools, Confluence, Jira, TestOps, Docker, Kibana, Java 17, Selenide, JUnit, Allure, Gradle, kafka.

Команда: 25 специалистов: 2 тестировщика, 3-4 backend-разработчиков, 4 frontend-разработчиков, бизнес-аналитик, 3 системных аналитика,  4 DevOps-инженера, проектный менеджер  и руководитель проекта.



Совместная программа лояльности для премиальных клиентов банка и люксового магазина:

Команда выступала в роли прокси-сервера с логикой во взаимодействии;

Тестирование API с использованием Postman: проверка запросов и ответов, валидация данных;

Проведение ручного функционального тестирования с анализом требований;

Анализ логов и мониторинг ошибок с помощью Kibana;

Составление тестовой документации: чек-лист, баг-репорт, отчет о тестировании.



Стек: Postman, DevTools, Confluence, Jira.

Команда: ~18 специалистов: 1 тестировщик, 3 backend-разработчиков, системный аналитик, 2 DevOps-инженера, проектный менеджер и руководитель проекта, тех лид.



Интеграция системы платежей и лояльности сети розничных магазинов с банковской инфраструктурой

Тестирование API с использованием Postman: проверка запросов и ответов, валидация данных;

Проведение ручного функционального тестирования с анализом требований;

Анализ логов и мониторинг ошибок с помощью Kibana;

Составление тестовой документации: чек-лист, баг-репорт, отчёт о тестировании;



Стек: Postman, DevTools, Confluence, Jira.

Команда: ~13 специалистов: 1 тестировщик, 2 backend-разработчиков, 2 frontend-разработчиков, 2 системных аналитика , DevOps-инженер, 2 проектных менеджера, руководитель проекта и тех лид.







Система мониторинга недропользования для крупных нефтяных компаний

Январь 2023 — Август 2023 (8 месяцев)



Задачи:



Проведение функционального тестирования системы;

Тестирование пользовательского интерфейса с использованием Playwright (проверка кросс-браузерности, валидации данных и взаимодействия элементов);

Разработка автотестов на Python с использованием Playwright и Pytest для UI и API тестирования;

Создание и поддержка тестового фреймворка с нуля на Python, включая интеграцию с Pytest;

Тестирование API через Postman: проверка корректности запросов, анализ ответов, валидация данных;

Работа с базой данных PostgreSQL для проверки корректности хранения и обработки данных.



Стек: Python, Playwright, Pytest, Postman, PostgreSQL, DevTools, Confluence, Jira, Allure.

Команда: ~13 специалистов: 3 тестировщика, 4 backend-разработчиков, 3 frontend-разработчиков, 3 системных аналитика , 1 инженер тех-поддержки, 2 проектных менеджера,1 инженер баз данных руководитель проекта и тех лид.







Автоматизированное рабочее место обработки клиентских заявок для крупнейшего банка России

Январь 2022 — Декабрь 2022 (1 год)



Задачи:



Разработка E2E автотестов на Java с использованием Selenium и Rest Assured;

Написание скриптов для автоматизации тестирования и упрощения тестовых операций;

Создание модулей для автотестирования, обеспечивающих повторное использование кода и масштабируемость тестов;

Автоматизация тестирования API с использованием Rest Assured и Insomnia;

Работа с PostgreSQL для валидации данных, внесенных через UI и API;

Составление тест-кейсов для ручного и автоматизированного тестирования;

Настройка и автоматизация запуска автотестов в Jenkins, интеграция с CI/CD;

Составление тестовой документации: тест-кейсы, чек-листы, баг-репорты, отчёты о тестировании.



Стек: Java, Selenium, Rest Assured, TestNG, Maven, Insomnia, PostgreSQL, Allure TestOps, Jenkins, DevTools, Confluence, Jira.





`

const res2 = {
  "name": "Александр Т.",
  "position": "AQA Engineer",
  "grade": "Middle",
  "age": null,
  "experience": "3 года 2 месяца",
  "location": null,
  "technologies": [
    "Functional testing",
    "API testing",
    "UI testing",
    "E2E testing",
    "Cross-browser testing",
    "Regression testing",
    "Integration testing",
    "Black-box testing",
    "White-box testing"
  ],
  "databases": [
    "PostgreSQL",
    "Kafka"
  ],
  "operatingSystems": [],
  "webTechnologies": [],
  "devTools": [
    "Postman",
    "Rest Assured",
    "Insomnia",
    "Selenide",
    "Selenium",
    "Playwright",
    "JUnit",
    "TestNG",
    "Pytest",
    "Gradle",
    "Maven",
    "Docker",
    "Jenkins",
    "Allure",
    "Kibana",
    "Confluence",
    "Jira",
    "DevTools"
  ],
  "programmingLanguages": [
    "Java 17",
    "Python"
  ],
  "languages": [
    {
      "level": "B2",
      "name": "Английский"
    }
  ],
  "personalInfo": {
    "gender": null,
    "birthday": null,
    "citizenship": "РФ",
    "workPermit": null,
    "relocation": null,
    "businessTrips": null
  },
  "education": {
    "level": "Высшее",
    "year": 2024,
    "institution": "КНИТУ им. А.Н. Туполева-КАИ",
    "specialization": "Программная инженерия"
  },
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "Банк (NDA)",
      "description": "Партнерские интеграции для крупнейшего частного банка России",
      "duration": "08.2023 — н.в.",
      "role": "AQA Engineer",
      "duties": [
        "Проведение ручного функционального тестирования с анализом требований и составлением тест-кейсов",
        "Разработка и автоматизация тестов API на Java с использованием REST-assured",
        "Тестирование пользовательского интерфейса с использованием Selenide",
        "Разработка тестового фреймворка с нуля на Java",
        "Анализ логов и мониторинг ошибок с помощью Kibana",
        "Составление тестовой документации"
      ],
      "technologiesUsed": [
        "Postman",
        "DevTools",
        "Confluence",
        "Jira",
        "TestOps",
        "Docker",
        "Kibana",
        "Java 17",
        "Selenide",
        "JUnit",
        "Allure",
        "Gradle",
        "Kafka"
      ]
    },
    {
      "name": "Банк (NDA)",
      "description": "Совместная программа лояльности для премиальных клиентов банка и люксового магазина",
      "duration": "",
      "role": "AQA Engineer",
      "duties": [
        "Команда выступала в роли прокси-сервера с логикой во взаимодействии",
        "Тестирование API с использованием Postman",
        "Проведение ручного функционального тестирования",
        "Анализ логов и мониторинг ошибок с помощью Kibana",
        "Составление тестовой документации"
      ],
      "technologiesUsed": [
        "Postman",
        "DevTools",
        "Confluence",
        "Jira"
      ]
    },
    {
      "name": "Банк (NDA)",
      "description": "Интеграция системы платежей и лояльности сети розничных магазинов с банковской инфраструктурой",
      "duration": "",
      "role": "AQA Engineer",
      "duties": [
        "Тестирование API с использованием Postman: проверка запросов и ответов, валидация данных",
        "Проведение ручного функционального тестирования",
        "Анализ логов и мониторинг ошибок с помощью Kibana",
        "Составление тестовой документации: чек-лист, баг-репорт, отчёт о тестировании"
      ],
      "technologiesUsed": [
        "Postman",
        "DevTools",
        "Confluence",
        "Jira"
      ]
    },
    {
      "name": "NDA",
      "description": "Система мониторинга недропользования для крупных нефтяных компаний",
      "duration": "01.2023 — 08.2023 (8 месяцев)",
      "role": "AQA Engineer",
      "duties": [
        "Проведение функционального тестирования системы",
        "Тестирование пользовательского интерфейса с использованием Playwright (проверка кросс-браузерности, валидации данных и взаимодействия элементов)",
        "Разработка автотестов на Python с использованием Playwright и Pytest для UI и API тестирования",
        "Создание и поддержка тестового фреймворка с нуля на Python, включая интеграцию с Pytest",
        "Тестирование API через Postman: проверка корректности запросов, анализ ответов, валидация данных",
        "Работа с базой данных PostgreSQL для проверки корректности хранения и обработки данных"
      ],
      "technologiesUsed": [
        "Python",
        "Playwright",
        "Pytest",
        "Postman",
        "PostgreSQL",
        "DevTools",
        "Confluence",
        "Jira",
        "Allure"
      ]
    },
    {
      "name": "Банк (NDA)",
      "description": "Автоматизированное рабочее место обработки клиентских заявок для крупнейшего банка России",
      "duration": "01.2022 — 12.2022 (1 год)",
      "role": "AQA Engineer",
      "duties": [
        "Разработка E2E автотестов на Java с использованием Selenium и Rest Assured",
        "Написание скриптов для автоматизации тестирования и упрощения тестовых операций",
        "Создание модулей для автотестирования, обеспечивающих повторное использование кода и масштабируемость тестов",
        "Автоматизация тестирования API с использованием Rest Assured и Insomnia",
        "Работа с PostgreSQL для валидации данных, внесенных через UI и API",
        "Составление тест-кейсов для ручного и автоматизированного тестирования",
        "Настройка и автоматизация запуска автотестов в Jenkins, интеграция с CI/CD",
        "Составление тестовой документации: тест-кейсы, чек-листы, баг-репорты, отчёты о тестировании",
      ],
      "technologiesUsed": [
        "Java",
        "Selenium",
        "Rest Assured",
        "TestNG",
        "Maven",
        "Insomnia",
        "PostgreSQL",
        "Allure TestOps",
        "Jenkins",
        "DevTools",
        "Confluence",
        "Jira"
      ]
    }
  ]
}