export const text3 = `Максим - Инженер по тестированию 

Дата рождения: 04.01.1998 (27 лет)

Локация: Россия, р. Крым, г. Севастополь

Часовой пояс: Московский часовой пояс — UTC+3

Опыт работы: 7 лет в ИТ: 2 года как iOS разработчик, 1 года менеджер проектов, 3 года QA специалист.

Технические знания и навыки: 

Знание и понимание теории тестирования.

Тестирование API: Postman, Swagger, Rest API, SOAP.

Тестирование WEB: Figma, DevTools, Perfect Pixel, Git, BrowserStack.

Снифферы: Charles, Fiddler, Proxyman.

Работа с очередью: Apache Kafka, RabbitMQ.

База данных: SQL, DBeaver, PostgreSQL, MongoDB.

Тестирование мобильных устройств: Testflight, APK.

Автотестирование: ООП, Java, Playwright, Selenium/Selenide, NodeJS, REST-assured, TestNG, Allure.

Сборка приложения: Maven, Gradle.

Таск-трекеры: Битрикс24, Jira, Youtrack, RedMine, Яндекс.Трекер.

Документация: Confluence, База знаний Youtrack, RedMine.

Образование: 

2017 г. Севастопольский государственный университет, Программирование в ПК системах – техник-программист (Средне специальное).

Владение языками:  английский — B2



Участив в проектах:

Онлайн платформа для проведения обучения и оценки сотрудников

Период работы: сентябрь 2024 — по настоящее время (6 месяцев)

Роль на проекте: QA Engineer

Описание: Сервис для формирования корпоративной базы знаний с возможностью одновременного редактирования веб-документов. Система настройки прав доступа. Траектории обучения новых сотрудников. Автоматизация оценки. В рамках проекта с нуля была написана структура тестовых сценариев и автотестов.

Задачи:

Автоматизированное тестирование.

Отладка и сопровождение автотестов.

Тестирование API (REST/Soap).

Описание багов и контроль их исправления.

Согласование плана тестирования.

Написание сценариев тестирования.

Стек: Java, Selenide, GitLab CI, Jenkins, Cucumber, Jira, TestIT, SQL.

Состав команды: PM, 3 backend разработчика, 3 frontend разработчик, 2 QA, дизайнер.

Сервис подачи документов НРД, НКЦ для клиентов биржи, и их обработки системой

Период работы: сентябрь 2023 — сентябрь 2024 (12 месяцев)

Роль на проекте: QA Engineer

Сфера деятельности: IT услуги

Описание: Данный проект был направлен на импортозамещение уже существующего проекта, а также его редизайн и улучшения.В рамках проекта был практически с нуля переделан весь функционал, фронтенд и система обработки документов. С нуля была написана структура тестовых сценариев и автотестов.

Задачи:

Ручное и автоматизированное тестирование.

Отладка и сопровождение автотестов.

Тестирование API (REST/Soap).

Тестирование мобильной версии сайта.

Описание багов и контроль их исправления.

Согласование плана тестирования.

Написание сценариев тестирования.

Стек: Java, GitLab CI, Jenkins, Postman, SoapUI, Chrome DevTools, Jira, TestLink, SQL.

Состав команды: PM, product manager, 2 backend разработчика, 1 frontend разработчик, 4 QA, дизайнер.

Документация для внутренних банковских систем

Период: январь 2023 — сентябрь 2023 (9 месяцев)

Роль: QA Engineer

Сфера деятельности:  финтех

Описание: Проект направлен на создание и поддержку документации для внутренних банковских систем, что позволяет улучшить процессы и повысить эффективность работы сотрудников. Главным в рамках проекта было создать CRM с удобным и понятным фронтендом для сотрудников банка.

Задачи:

Проведение функционального тестирование ПО.

Тестирование API (REST/Soap).

Тестирование пользовательских интерфейсов.

Проведение регрессионного тестирования и смоук тестирования.

Ведение документации тестирования (план, сценарии, кейсы, чек-листы).

Взаимодействие с руководителями и разработчиками. 

Настройка тестового окружения.

Стек: Kafka, Postman, Qase, Figma, Jira, Confluence.

Состав команды: PM, product manager, backend разработчик, frontend разработчик, два QA, дизайнер.

Управление производственной мощностью

Период: январь 2023 — сентябрь 2023 (9 месяцев)

Роль: QA Engineer

Сфера деятельности: финтех

Описание: Система управления производственной мощностью помогает предприятиям оптимизировать свои ресурсы и повысить эффективность. Проект направлен на оптимизацию и увеличение количества пользователей для различных ресурсов. А также на предоставлении своих мощностей в аренду клиентам.

Задачи:

Проведение функционального тестирование ПО.

Тестирование API (REST/Soap).

Тестирование пользовательских интерфейсов.

Проведение регрессионного тестирования и смоук тестирования.

Ведение документации тестирования (план, сценарии, кейсы, чек-листы).Взаимодействие с руководителями и разработчиками.

Настройка тестового окружения.

Стек: Java, Postman, Java Spring, Camunda, Qase, Figma, Jira, Confluence.

Состав команды: PM, 2 backend разработчика, 3 frontend разработчика, 2 QA, дизайнер.

Платформа для проведения гос. закупок

Период: август 2022 — май 2023 (10 месяцев)

Роль: QA Lead

Сфера деятельности: финтех

Описание: Платформа предназначена для упрощения и автоматизации процессов государственных закупок для предпринимателей и компаний. Был большой упор на API и бекенд, в связи с чем команда состояла преимущественно из бекенд разработчиков. Был лидером команды тестирования.

Задачи:

Написание автотестов с помощью TestNG, Java, Maven.

Тестирование API (REST/Soap).

Написание документации по функционалу.

Функциональное и регрессионное тестирование.

Формирование плана тестирования.

Коммуникация с тимлидами других компетенций.

Распределение задач.

Планирование релизной политики.

Проведение демо.

Стек:  TestNG, Java, Maven, DevTools, Swagger, Jira, Postman, Perfect Pixel.

Состав команды: PM, product manager, 10 backend разработчик, 1 frontend разработчик, 4 QA, дизайнер.

Корпоративный мессенджер с видео звонками, конференциями

Период: ноябрь 2021 — март 2022 (5 месяцев)

Роль: QA Engineer

Описание: Мессенджер разработан для корпоративного общения и поддержки видеозвонков, что позволяет командам эффективно взаимодействовать. Продукт изначально был представлен как платформа для дистанционного обучения, но впоследствии руководством было принято решение расширить бизнес-модель, и добавить полноценный мессенджер для корпоративных клиентов.

Задачи:

Функциональное тестирование.

Написание автотестов.

Тестирование мобильного приложения.

Тестирование API (REST/Soap).

Описание багов и контроль их исправления.

Тестирование Android и IOS.

Стек: Postman, Jira, Confluence, Java, BitBucket, Android Studio.

Состав команды: PM, product manager, 2 backend разработчика, 3 frontend разработчика, 4 мобильных разработчика, 2 QA, дизайнер.

Банковская система для работы с льготниками

Период: ноябрь 2021 — март 2022 (5 месяцев)

Роль: QA Engineer

Описание: Система помогает банкам управлять выплатами и социальными льготами для льготной категории граждан РФ. Большая микросервисная архитектура проекта была создана сразу несколькими командами, а стадия отладки и тестирования проводилась целых 3 месяца.

Задачи:

Функциональное тестирование.

Тестирование API (REST/Soap).

Описание багов и контроль их исправления.

Написание сценариев тестирования.

Выявление и документирование багов.

Стек: Postman, Chrome DevTools, Jira, Test IT.

Состав команды: PM, product manager, 5  backend разработчик, 4 frontend разработчика, 4 QA, 2 дизайнера.

CRM для банковских систем

Период: апрель 2021 — июнь 2021 (3 месяца)

Роль: QA Engineer

Описание: CRM система предназначена для управления клиентами и продажами в банковской сфере. Была полностью переработана уже устаревшая легаси-система, создан новый фронтенд, переработаны базы данных.

Задачи:

Мануальное тестирование.

Тестирование Android и IOS.

Тестирование API. (Rest/Soap)

Описание багов и контроль их исправления. 

Написание сценариев тестирования.

Выявление и документирование багов.

Тестирование на совместимость со сторонними web-сервисами.

Стек: Postman, SoapUI, Chrome DevTools, Jira, TestLink, Android Studio, Xcode.

Состав команды: PM, product manager, 2 backend разработчика, 3 frontend разработчика, 3 QA, дизайнер.

Хостинг блокчейн-систем для американских компаний

Период: июнь 2020 — апрель 2021 (11 месяцев)

Роль: AQA Engineer

Описание:  Проект предоставляет услуги хостинга для компаний и инвесторов, желающих сделать вклады или счета в криптовалюте. Команда стартапа была межнациональной, и включала в себя специалистов из Америки, Китая, Японии, Индии, Италии. На проекте я был единственным русскоговорящим специалистом, вся коммуникация и документация велись на английском языке.

Задачи:

Автоматизированное тестирование.

Составление сценариев для автотестов.

Выявление и документирование багов.

Тестирование API. (Rest/Soap)

Описание багов и контроль их исправления. 

Написание сценариев тестирования.

Стек: Selenium (оболочка Puppeteer), Jest/Mocha, Node.js, Git, Jenkins.

Состав команды: PM, product manager, backend разработчик, frontend разработчик, 1 QA, дизайнер.

CRM для банковских систем

Период: декабрь 2018 — май 2019 (6 месяцев)

Роль: AQA Engineer

Описание: CRM система предназначена для управления клиентами и оптимизации бизнес-процессов в банковском секторе. Разработка велась на уже работающей системе, внедряя новые изменения “по кусочкам”. Было важно не сломать уже работающие компоненты, чтобы не нарушить работу сотрудников банка.

Задачи:

Автоматизированное тестирование.

Составление тест-планов с бизнес-аналитиком и заказчиком.

Мануальное тестирование.

Тестирование API (REST/Soap).

Описание багов и контроль их исправления.

Написание сценариев тестирования.

Выявление и документирование багов.

Написание автотестов.

Сбор информации о нагрузочном тестировании.

Стек: Selenium, Java, ChromeDriver, Node.js, Mocha, Git, Postman, SQL, Grafana.

Состав команды: PM, product manager, 2 backend разработчика, 2 frontend разработчика, 2 QA, дизайнер.

Облачное хранение файлов

Период: ноябрь 2018 — май 2019 (7 месяцев)

Роль: QA Engineer

Описание: Проект предоставляет услуги облачного хранения файлов, обеспечивая пользователям доступ к данным из любой точки мира. На проекте использовались новейшие на то время технологии нагрузочного и стресс-тестирования, а также тестирование производительности. 

Задачи:

Мануальное тестирование.

Тестирование мобильного приложения.

Тестирование API (REST/Soap).

Тестирование Android и IOS.

Описание багов и контроль их исправления.

Написание сценариев тестирования.

Выявление и документирование багов.

Сбор информации о нагрузочном тестирование через Yandex Tank.

Стек: Postman, Chrome DevTools, Jira, Test IT, Nginx, Yandex Tank, Яндекс.трекер, SQL, Android Studio, Xcode, BrowserStack.

Состав команды: PM, product manager, 10 backend разработчиков,5 frontend разработчиков, 5 мобильных разработчиков, 8 QA, 3 дизайнера.

Сервис поиска авиа/жд билетов

Период: август 2017 — август 2018 (12  месяцев)

Роль: QA Engineer

Описание: Сервис предназначен для поиска и бронирования авиационных и железнодорожных билетов, упрощая процесс планирования поездок для пользователей. Впоследствии добавилась также возможность бронирования отелей и гостевых номеров, для клиентов купивших билеты. Было множество интеграций с партнерами, банками и рекламными агентствами.

Задачи:

Тестирование мобильного приложения.

Описание багов и контроль их исправления.

Написание сценариев тестирования.

Выявление и документирование багов. 

Тестирование API (REST/Soap).

Тестирование мобильной версии сайта.

Стек: Postman, SoapUI, Chrome DevTools, MongoDB, Redmine, TestLink, SQL, Android Studio, Xcode.

Состав команды: PM, product manager,3 backend разработчика, 3 frontend разработчика, 3 мобильных разработчика, 5 QA, дизайнер.



Сопроводительное письмо:

Моя карьера в IT началась с разработки iOS-приложений, где я проработал около двух лет и достиг уровня middle. Я QA-инженер с более чем семи годами опыта в тестировании. Моя карьера началась с ручного тестирования, что позволило мне глубже понять процесс разработки программного обеспечения и важность обеспечения его качества на всех этапах. Для написания автотестов вначале использовал Node.js, Selenium, Jest и Mocha и Java. Большинство проектов было на Java благодаря её удобству и широким возможностям. Также пробовал Python, чтобы расширить свой кругозор и увидеть подходы автоматизации с другой стороны.

Создавал и поддержка автотесты для веб-сервисов и API. Имею опыт интеграции автотестов в CI/CD процессы (Jenkins, GitLab CI) писал непосредственно UML файлы, что помогает получать быструю обратную связь на каждом этапе разработки. При необходимости участвую в ручном тестировании, создании тест-планов и тест-кейсов.

В процессе пришел к тому, что Java для меня самый удобный язык для написания автотестов. При необходимости я также участвую в мануальном тестировании, составлении тест-планов, тест-кейсов. Мне одинаково нравится как писать сценарии тестирования так и их автоматизировать.Мой подход к автоматизации включает тесное сотрудничество с разработчиками и бизнес-аналитиками для создания тестов, которые отражают реальные пользовательские сценарии и требования.

Самая интереская:

Работа над стартапом в международной команде.

Самая технически сложная задача:

Разработка автотестов для многоуровневого сайта (iframe).

`

export const res3 = {
  "name": "Максим",
  "position": "QA engineer",
  "grade": "Senior",
  "age": 27,
  "experience": "7 лет",
  "location": "Россия, р. Крым, г. Севастополь",
  "technologies": [
    "Postman",
    "Swagger",
    "Rest API",
    "SOAP",
    "Figma",
    "DevTools",
    "Perfect Pixel",
    "Git",
    "BrowserStack",
    "Charles",
    "Fiddler",
    "Proxyman",
    "Apache Kafka",
    "RabbitMQ",
    "SQL",
    "DBeaver",
    "PostgreSQL",
    "MongoDB",
    "Testflight",
    "APK",
    "Java",
    "Playwright",
    "Selenium/Selenide",
    "NodeJS",
    "REST-assured",
    "TestNG",
    "Allure",
    "Maven",
    "Gradle",
    "Битрикс24",
    "Jira",
    "Youtrack",
    "RedMine",
    "Яндекс.Трекер",
    "Confluence"
  ],
  "databases": [
    "SQL",
    "DBeaver",
    "PostgreSQL",
    "MongoDB"
  ],
  "operatingSystems": [],
  "webTechnologies": [],
  "devTools": [
    "Postman",
    "Swagger",
    "DevTools",
    "Chrome DevTools",
    "GitLab CI",
    "Jenkins",
    "Qase",
    "TestLink",
    "Yandex Tank"
  ],
  "programmingLanguages": [
    "Java",
    "Node.js"
  ],
  "languages": [
    {
      "level": "B2",
      "name": "английский"
    }
  ],
  "personalInfo": {
    "gender": "не указано",
    "birthday": "04.01.1998",
    "citizenship": "не указано",
    "workPermit": "не указано",
    "relocation": "не указано",
    "businessTrips": "не указано"
  },
  "education": {
    "level": "Средне специальное",
    "year": 2017,
    "institution": "Севастопольский государственный университет",
    "specialization": "Программирование в ПК системах"
  },
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "Онлайн платформа для проведения обучения и оценки сотрудников",
      "description": "Сервис для формирования корпоративной базы знаний с возможностью одновременного редактирования веб-документов. Система настройки прав доступа. Траектории обучения новых сотрудников. Автоматизация оценки. В рамках проекта с нуля была написана структура тестовых сценариев и автотестов.",
      "duration": "09.2024 — по настоящее время",
      "role": "QA Engineer",
      "duties": [
        "Автоматизированное тестирование",
        "Отладка и сопровождение автотестов",
        "Тестирование API (REST/Soap)",
        "Описание багов и контроль их исправления",
        "Согласование плана тестирования",
        "Написание сценариев тестирования"
      ],
      "technologiesUsed": [
        "Java",
        "Selenide",
        "GitLab CI",
        "Jenkins",
        "Cucumber",
        "Jira",
        "TestIT",
        "SQL"
      ]
    },
    {
      "name": "Сервис подачи документов НРД, НКЦ для клиентов биржи, и их обработки системой",
      "description": "Данный проект был направлен на импортозамещение уже существующего проекта, а также его редизайн и улучшения. В рамках проекта был практически с нуля переделан весь функционал, фронтенд и система обработки документов. С нуля была написана структура тестовых сценариев и автотестов.",
      "duration": "09.2023 — 09.2024 (1 год)",
      "role": "QA Engineer",
      "duties": [
        "Ручное и автоматизированное тестирование",
        "Отладка и сопровождение автотестов",
        "Тестирование API (REST/Soap)",
        "Тестирование мобильной версии сайта",
        "Описание багов и контроль их исправления",
        "Согласование плана тестирования",
        "Написание сценариев тестирования"
      ],
      "technologiesUsed": [
        "Java",
        "GitLab CI",
        "Jenkins",
        "Postman",
        "SoapUI",
        "Chrome DevTools",
        "Jira",
        "TestLink",
        "SQL"
      ]
    },
    {
      "name": "Документация для внутренних банковских систем",
      "description": "Проект направлен на создание и поддержку документации для внутренних банковских систем, что позволяет улучшить процессы и повысить эффективность работы сотрудников. Главным в рамках проекта было создать CRM с удобным и понятным фронтендом для сотрудников банка.",
      "duration": "01.2023 — 09.2023 (9 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Проведение функционального тестирования ПО",
        "Тестирование API (REST/Soap)",
        "Тестирование пользовательских интерфейсов",
        "Проведение регрессионного тестирования и смоук тестирования",
        "Ведение документации тестирования (план, сценарии, кейсы, чек-листы)",
        "Взаимодействие с руководителями и разработчиками",
        "Настройка тестового окружения"
      ],
      "technologiesUsed": [
        "Kafka",
        "Postman",
        "Qase",
        "Figma",
        "Jira",
        "Confluence"
      ]
    },
    {
      "name": "Управление производственной мощностью",
      "description": "Система управления производственной мощностью помогает предприятиям оптимизировать свои ресурсы и повысить эффективность. Проект направлен на оптимизацию и увеличение количества пользователей для различных ресурсов. А также на предоставлении своих мощностей в аренду клиентам.",
      "duration": "01.2023 — 09.2023 (9 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Проведение функционального тестирования ПО",
        "Тестирование API (REST/Soap)",
        "Тестирование пользовательских интерфейсов",
        "Проведение регрессионного тестирования и смоук тестирования",
        "Ведение документации тестирования (план, сценарии, кейсы, чек-листы)",
        "Взаимодействие с руководителями и разработчиками",
        "Настройка тестового окружения"
      ],
      "technologiesUsed": [
        "Java",
        "Postman",
        "Java Spring",
        "Camunda",
        "Qase",
        "Figma",
        "Jira",
        "Confluence"
      ]
    },
    {
      "name": "Платформа для проведения гос. закупок",
      "description": "Платформа предназначена для упрощения и автоматизации процессов государственных закупок для предпринимателей и компаний. Был большой упор на API и бекенд, в связи с чем команда состояла преимущественно из бекенд разработчиков. Был лидером команды тестирования.",
      "duration": "08.2022 — 05.2023 (10 месяцев)",
      "role": "QA Lead",
      "duties": [
        "Написание автотестов с помощью TestNG, Java, Maven",
        "Тестирование API (REST/Soap)",
        "Написание документации по функционалу",
        "Функциональное и регрессионное тестирование",
        "Формирование плана тестирования",
        "Коммуникация с тимлидами других компетенций",
        "Распределение задач",
        "Планирование релизной политики",
        "Проведение демо"
      ],
      "technologiesUsed": [
        "TestNG",
        "Java",
        "Maven",
        "DevTools",
        "Swagger",
        "Jira",
        "Postman",
        "Perfect Pixel"
      ]
    },
    {
      "name": "Корпоративный мессенджер с видео звонками, конференциями",
      "description": "Мессенджер разработан для корпоративного общения и поддержки видеозвонков, что позволяет командам эффективно взаимодействовать. Продукт изначально был представлен как платформа для дистанционного обучения, но впоследствии руководством было принято решение расширить бизнес-модель, и добавить полноценный мессенджер для корпоративных клиентов.",
      "duration": "11.2021 — 03.2022 (8 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Функциональное тестирование",
        "Написание автотестов",
        "Тестирование мобильного приложения",
        "Тестирование API (REST/Soap)",
        "Описание багов и контроль их исправления",
        "Тестирование Android и IOS"
      ],
      "technologiesUsed": [
        "Postman",
        "Jira",
        "Confluence",
        "Java",
        "BitBucket",
        "Android Studio"
      ]
    },
    {
      "name": "Банковская система для работы с льготниками",
      "description": "Система помогает банкам управлять выплатами и социальными льготами для льготной категории граждан РФ.",
      "duration": "11.2021 — 03.2022 (3 месяца)",
      "role": "QA Engineer",
      "duties": [
        "Функциональное тестирование",
        "Тестирование API (REST/Soap)",
        "Описание багов и контроль их исправления",
        "Написание сценариев тестирования",
        "Выявление и документирование багов"
      ],
      "technologiesUsed": [
        "Postman",
        "Chrome DevTools",
        "Jira",
        "Test IT"
      ]
    },
    {
      "name": "CRM для банковских систем",
      "description": "CRM система предназначена для управления клиентами и продажами в банковской сфере. Была полностью переработана уже устаревшая легаси-система, создан новый фронтенд, переработаны базы данных.",
      "duration": "04.2021 — 06.2021 (8 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Мануальное тестирование",
        "Тестирование Android и IOS",
        "Тестирование API (Rest/Soap)",
        "Описание багов и контроль их исправления",
        "Написание сценариев тестирования",
        "Выявление и документирование багов",
        "Тестирование на совместимость со сторонними web-сервисами"
      ],
      "technologiesUsed": [
        "Postman",
        "SoapUI",
        "Chrome DevTools",
        "Jira",
        "TestLink",
        "Android Studio",
        "Xcode"
      ]
    },
    {
      "name": "Хостинг блокчейн-систем для американских компаний",
      "description": "Проект предоставляет услуги хостинга для компаний и инвесторов, желающих сделать вклады или счета в криптовалюте. Команда стартапа была межнациональной, и включала в себя специалистов из Америки, Китая, Японии, Индии, Италии. На проекте я был единственным русскоговорящим специалистом, вся коммуникация и документация велись на английском языке.",
      "duration": "06.2020 — 04.2021 (11 месяцев)",
      "role": "AQA Engineer",
      "duties": [
        "Автоматизированное тестирование",
        "Составление сценариев для автотестов",
        "Выявление и документирование багов",
        "Тестирование API (Rest/Soap)",
        "Описание багов и контроль их исправления",
        "Написание сценариев тестирования"
      ],
      "technologiesUsed": [
        "Selenium (оболочка Puppeteer)",
        "Jest/Mocha",
        "Node.js",
        "Git",
        "Jenkins"
      ]
    },
    {
      "name": "CRM для банковских систем",
      "description": "CRM система предназначена для управления клиентами и оптимизации бизнес-процессов в банковском секторе. Разработка велась на уже работающей системе, внедряя новые изменения “по кусочкам”. Было важно не сломать уже работающие компоненты, чтобы не нарушить работу сотрудников банка.",
      "duration": "12.2018 — 05.2019 (6 месяцев)",
      "role": "AQA Engineer",
      "duties": [
        "Автоматизированное тестирование",
        "Составление тест-планов с бизнес-аналитиком и заказчиком",
        "Мануальное тестирование",
        "Тестирование API (REST/Soap)",
        "Описание багов и контроль их исправления",
        "Написание сценариев тестирования",
        "Выявление и документирование багов",
        "Написание автотестов",
        "Сбор информации о нагрузочном тестировании"
      ],
      "technologiesUsed": [
        "Selenium",
        "Java",
        "ChromeDriver",
        "Node.js",
        "Mocha",
        "Git",
        "Postman",
        "SQL",
        "Grafana"
      ]
    },
    {
      "name": "Облачное хранение файлов",
      "description": "Проект предоставляет услуги облачного хранения файлов, обеспечивая пользователям доступ к данным из любой точки мира. На проекте использовались новейшие на то время технологии нагрузочного и стресс-тестирования, а также тестирование производительности.",
      "duration": "08.2018 — 12.2018 (5 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Мануальное тестирование",
        "Тестирование мобильного приложения",
        "Тестирование API (REST/Soap)",
        "Тестирование Android и IOS",
        "Описание багов и контроль их исправления",
        "Написание сценариев тестирования",
        "Выявление и документирование багов",
        "Сбор информации о нагрузочном тестировании через Yandex Tank"
      ],
      "technologiesUsed": [
        "Postman",
        "Chrome DevTools",
        "Jira",
        "Test IT",
        "Nginx",
        "Yandex Tank",
        "Яндекс.трекер",
        "SQL",
        "Android Studio",
        "Xcode",
        "BrowserStack"
      ]
    },
    {
      "name": "Сервис поиска авиа/жд билетов",
      "description": "Сервис предназначен для поиска и бронирования авиационных и железнодорожных билетов, упрощая процесс планирования поездок для пользователей. Впоследствии добавилась также возможность бронирования отелей и гостевых номеров, для клиентов купивших билеты. Было множество интеграций с партнерами, банками и рекламными агентствами.",
      "duration": "08.2017 — 08.2018 (1 год)",
      "role": "QA Engineer",
      "duties": [
        "Тестирование мобильного приложения",
        "Описание багов и контроль их исправления",
        "Написание сценариев тестирования",
        "Выявление и документирование багов",
        "Тестирование API (REST/Soap)",
        "Тестирование мобильной версии сайта"
      ],
      "technologiesUsed": [
        "Postman",
        "SoapUI",
        "Chrome DevTools",
        "MongoDB",
        "Redmine",
        "TestLink",
        "SQL",
        "Android Studio",
        "Xcode"
      ]
    }
  ]
}