export const text4 = `       NETPOLE 



Дмитрий Гундоров

Senior AQA Engineer (Python)



Гражданство: РФ

Локация: Санкт-Петербург

Английский: B1 - Средний

Опыт: 7 лет 1 месяц

Грейд: Senior





Образование

Магистр, 2017 Поволжский государственный университет телекоммуникаций и информатики, Самара

Управление в технических системах



Бакалавр, 2016

Поволжский государственный университет телекоммуникаций и информатики, Самара

Программное обеспечение вычислительной техники и автоматизированных систем

Ключевые навыки:

Python,

C++,

Selenium,

Selenoid,

Robot Framework,

Postman,

Locust,

Docker,

GitLab CI/CD,

SoapUI,

JMeter,

SQL (MySQL, PostgreSQL),

Linux,

Keras,

TensorFlow,

Pandas,

ООП,

BrowserStack,

Git.



Проекты



Период работы: Февраль 2021 — настоящее время (4 года)

Компания: Финансовая компания (под NDA)

Должность: AQA Engineer

Проект: Автоматизация тестирования финансовых сервисов

Обязанности:

Разработка автотестов на Python (Selenium, Selenoid) для веб-приложений

Тестирование API через Postman и SoapUI

Нагрузочное тестирование с использованием Locust и JMeter

Оркестрация тестовых окружений в Docker

Интеграция автотестов в GitLab CI/CD

Составление тестовой документации (тест-планы, тест-кейсы)

Основные достижения:

Автоматизировал 80% регрессионных тестов, сократив время релиза на 25%

Внедрил распределённое тестирование через Selenoid, увеличив скорость выполнения тестов в 3 раза

Оптимизировал работу с БД, разработав скрипты для генерации тестовых данных

Стек: Python, Selenium, Docker, GitLab CI/CD, PostgreSQL, Locust.



Период работы: Октябрь 2020 — Февраль 2021 (5 месяцев)

Компания: Люксофт

Должность: QA Engineer

Проект: Тестирование ERP-систем

Обязанности:

Ручное тестирование функционала

Написание тест-кейсов и приемо-сдаточных документов

Разработка автотестов на Python (Selenium, Robot Framework)

Тестирование API через Postman

Стек: Python, Robot Framework, Postman, BrowserStack.



Период работы: Декабрь 2019 — Сентябрь 2020 (10 месяцев)

Компания: ООО Новые технологии

Должность: QA Automation Engineer

Проект: Автоматизация тестирования CRM

Обязанности:

Планирование спринтов и тестовых циклов

Разработка автотестов на Python (Selenium, Locust)

Интеграция тестов в Selenoid для параллельного запуска

Основные достижения:

Снизил количество дефектов на продакшене на 35% за счет улучшения тестового покрытия

Стек: Python, Selenium, Locust, Selenoid.



Период работы: Октябрь 2018 — Декабрь 2019 (1 год 3 месяца)

Компания: Фриланс

Должность: QA Automation Engineer

Обязанности:

Тестирование мобильных и веб-приложений

Разработка торгового бота на Python

Создание тестовой документации для клиентов

Стек: Python, Selenium, Postman, BrowserStack.



Период работы: Январь 2018 — Октябрь 2018 (10 месяцев)

Компания: ТКБ

Должность: QA Engineer

Проект: Тестирование банковского ПО

Обязанности:

Нагрузочное тестирование через JMeter

Ручное тестирование интерфейсов

Составление ТЗ и функциональных требований

Стек: SoapUI, Postman, JMeter, SQL.





Будем рады сотрудничеству с вами! 🚀

Хорошего дня) 🌞











Алёшин Александр

+7 (929) 369-86-60

✉️Email: alyoshin@netpole.org

       tg: https://t.me/alexanderalyoshin





ООО “НЭТПОЛЬ”

https://netpole.tech/

Юридический адрес организации: 354054, Россия, край Краснодарский, г. Сочи, ул. Ясногорская, дом 16/2, корпус 6, офис кв. 57

ИНН: 7743379166



`

export const res4 = {
  "name": "Дмитрий Гундоров",
  "position": "Senior AQA Engineer (Python)",
  "grade": "Senior",
  "age": 0,
  "experience": "7 лет 1 месяц",
  "location": "Санкт-Петербург",
  "technologies": [
    "Python",
    "C++",
    "Selenium",
    "Selenoid",
    "Robot Framework",
    "Postman",
    "Locust",
    "Docker",
    "GitLab CI/CD",
    "SoapUI",
    "JMeter",
    "SQL (MySQL, PostgreSQL)",
    "Linux",
    "Keras",
    "TensorFlow",
    "Pandas",
    "ООП",
    "BrowserStack",
    "Git"
  ],
  "databases": [
    "MySQL",
    "PostgreSQL"
  ],
  "operatingSystems": [
    "Linux"
  ],
  "webTechnologies": [],
  "devTools": [
    "Docker",
    "GitLab CI/CD",
    "SoapUI",
    "Postman",
    "JMeter",
    "BrowserStack"
  ],
  "programmingLanguages": [
    "Python",
    "C++"
  ],
  "languages": [
    {
      "level": "B1 - Средний",
      "name": "Английский"
    }
  ],
  "personalInfo": {
    "gender": "",
    "birthday": "",
    "citizenship": "РФ",
    "workPermit": "",
    "relocation": "",
    "businessTrips": ""
  },
  "education": [
    {
      "level": "Магистр",
      "year": 2017,
      "institution": "Поволжский государственный университет телекоммуникаций и информатики",
      "specialization": "Управление в технических системах"
    },
    {
      "level": "Бакалавр",
      "year": 2016,
      "institution": "Поволжский государственный университет телекоммуникаций и информатики",
      "specialization": "Программное обеспечение вычислительной техники и автоматизированных систем"
    }
  ],
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "Финансовая компания (под NDA)",
      "description": "Автоматизация тестирования финансовых сервисов",
      "duration": "Февраль 2021 — настоящее время",
      "role": "AQA Engineer",
      "duties": [
        "Разработка автотестов на Python (Selenium, Selenoid) для веб-приложений",
        "Тестирование API через Postman и SoapUI",
        "Нагрузочное тестирование с использованием Locust и JMeter",
        "Оркестрация тестовых окружений в Docker",
        "Интеграция автотестов в GitLab CI/CD",
        "Составление тестовой документации (тест-планы, тест-кейсы)"
      ],
      "technologiesUsed": [
        "Python",
        "Selenium",
        "Docker",
        "GitLab CI/CD",
        "PostgreSQL",
        "Locust"
      ]
    },
    {
      "name": "Люксофт",
      "description": "Тестирование ERP-систем",
      "duration": "Октябрь 2020 — Февраль 2021 (5 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Ручное тестирование функционала",
        "Написание тест-кейсов и приемо-сдаточных документов",
        "Разработка автотестов на Python (Selenium, Robot Framework)",
        "Тестирование API через Postman"
      ],
      "technologiesUsed": [
        "Python",
        "Robot Framework",
        "Postman",
        "BrowserStack"
      ]
    },
    {
      "name": "ООО Новые технологии",
      "description": "Автоматизация тестирования CRM",
      "duration": "Декабрь 2019 — Сентябрь 2020 (10 месяцев)",
      "role": "QA Automation Engineer",
      "duties": [
        "Планирование спринтов и тестовых циклов",
        "Разработка автотестов на Python (Selenium, Locust)",
        "Интеграция тестов в Selenoid для параллельного запуска"
      ],
      "technologiesUsed": [
        "Python",
        "Selenium",
        "Locust",
        "Selenoid"
      ]
    },
    {
      "name": "Фриланс",
      "description": "Тестирование мобильных и веб-приложений",
      "duration": "Октябрь 2018 — Декабрь 2019 (1 год 3 месяца)",
      "role": "QA Automation Engineer",
      "duties": [
        "Тестирование мобильных и веб-приложений",
        "Разработка торгового бота на Python",
        "Создание тестовой документации для клиентов"
      ],
      "technologiesUsed": [
        "Python",
        "Selenium",
        "Postman",
        "BrowserStack"
      ]
    },
    {
      "name": "ТКБ",
      "description": "Тестирование банковского ПО",
      "duration": "Январь 2018 — Октябрь 2018 (10 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Нагрузочное тестирование через JMeter",
        "Ручное тестирование интерфейсов",
        "Составление ТЗ и функциональных требований"
      ],
      "technologiesUsed": [
        "SoapUI",
        "Postman",
        "JMeter",
        "SQL"
      ]
    }
  ]
}