const text5 = `ОлегDevOps

Гражданство: РФ

Местоположение: Москва



Специализация и профессиональные навыки:

Ansible 

Terraform

Liquibase

Grafana

Vmware

Zabbix    

PostgreSQL  

MongoDB  

Nginx  

Bash  

PowerShell  

Python

Kubernetes  

Helm

Docker  

Docker-compose

Jenkins  

OpenSearch

Gitlab  

Git

Hashicorp Vault

Техническое обслуживание ПК

Знание ОС Windows

Настройка ПК

Офисная техника

Модульный ремонт техники

Монтаж кабельных сетей

Active Directory

Prometheus

ArgoCD

Kubernetes On-Prem BareMetal

DHCP

DNS

GPO

MS Exchange

CNI, CSI

Настройка сетевых подключений

Настройка DNS

SCCM

Kaspersky Security Center

Знание нормативной документации по проектированию, ГОСТов, ISO стандартов

Опыт настройки сетевого оборудования CISCO

Администрирование серверного оборудования (Windows Server 2012 R2, 2016)

Опыт администрирования Microsoft Exchange (2010, 2019, O365)

Работоспособность

Системность мышления

Ответственность

Быстрая обучаемость

Коммуникабельность

Стрессоустойчивость

Знание языков

Русский —  Родной

Образование



2018

Московский государственный технологический университет "Станкин", Москва

Автоматизации и робототехники, Мехатроника и робототехника

2016

Московский государственный технологический университет "Станкин", Москва

Информационных технологий и систем управления, Мехатроника и робототехника

Участие в проектах 



06.2024 – 01.2025

Разработка ПО

Роль: DevOps-инженер

Проект: Сопровождение нагрузочного тестирования, поддержка стендов разработки.

Задачи:

Развертывание и администрирование dev и тестовых стендов для обеспечения непрерывного процесса разработки:

Получение и администрирование проектов k8s

Получение и администрирование виртуальных машин

Конфигурирование и администрирование БД 

Настройка конвейера для поставки на стенд

Настройка и поддержка процесса DevOps, в т.ч. CI/CD процессов.

Работа с Linux и развертывание там системы работы с Liquibase.

Работа с MSSQL.

Мониторинг производительности приложений и инфраструктуры с использованием Grafana.

Создание и настройка панелей мониторинга для визуализации данных из различных источников.

Интеграция Grafana с другими инструментами, такими как Prometheus, для сбора метрик.

Управление виртуализацией и развертыванием приложений на платформе VMware.

Конфигурация и оптимизация виртуальных машин для повышения производительности.

 Автоматизация процессов развертывания и управления инфраструктурой с использованием инструментов CI/CD.

Обеспечение безопасности и управления доступом к ресурсам VMware.

Анализ и отладка системы мониторинга для повышения надежности и доступности.

Администрирование Gitlab репозиториев.

Написание скриптов на Bash.

Работа с Win/Linux системами.

Участие в тестировании ПО, которое предоставляет компания.

Развертывание с нуля Zabbix.

Создание домена на базе Active Directory.

Организация VPN-туннеля IPSec на базе Linux.

Создание и настройка сервера SCCM.

Администрирование SQL Server для SCCM.

Администрирование Terminal Server.

Сопровождение и поддержка пользователей.

Используемые технологии: Linux, Active Directory, IPSec, SCCM, Prometheus, HSM, Liquibase, Kubernetes On-Prem BareMetal, MSSQL, Gitlab, Bash, Vmware, Grafan, Helm, Hashicorp Vault, , ArgoCD, OpenSearch, CNI, CSI.

08.2020-06.2024

Завод пищевого производства

Роль: DevOps

Проект: Сопровождение миграции пользователей между доменам Active Directory

Задачи:

Создание/настройка инфраструктуры dev, preprod, prod окружений.

Настройка и поддержка служб микросервисных приложений с помощью шаблонов Helm и Kubernetes.

Выполнение задач, поставленных в Jira и Redmine.

Работа в Confluence и WikiJS.

Разработка и поддержка Kubernetes кластера на BareMetal.

Настройка и управление сетевыми плагинами (CNI) и хранилищами данных (CSI).

Создание и управление Helm-чартами для упрощения развертывания приложений.

Автоматизация установки, обновления и удаления приложений в кластере Kubernetes.

Управление секретами и конфиденциальной информацией.

Настройка политик доступа и средств шифрования данных.

Настройка системы мониторинга для сбора метрик приложений и инфраструктуры.

Создание дашбордов и алертов для оперативного реагирования на проблемы.

Настройка автоматизированных процессов развертывания приложений.

Управление конфигурациями и версиями приложений с помощью GitOps.

Настройка и поддержка системы для индексации и поиска логов.

Анализ данных для выявления проблем и улучшения производительности приложений.

Четкая координация между командами разработки и операциями для ускорения циклов разработки.

Автоматизация повторяющихся задач для повышения эффективности.

Администрирование Active Directory, принт сервера, почтового сервера (Exchange 2019, Exchange Online) в части создания/блокировки и аудита учетных записей сотрудников; Администрирование и аудит внутренних корпоративных систем.

Написание инструкций по пользованию ПО и оборудованием для сотрудников ИТ отдела и обычных пользователей.

Администрирование Kaspersky Security Center.

Работа с продуктами 1С.

Внедрение системы учёта ИТ оборудования на базе 1С Бухгалтерия - написание ТЗ для отдела разработки, выявление ошибок во время опытной эксплуатации системы.

Обработка и маршрутизация обращений пользователей в системе HelpDesk (GLPI).



Используемые технологии: Linux, Active Directory, Prometheus, IPSec, SCCM, HSM, Kubernetes On-Prem BareMetal, Kubernetes, ArgoCD, Liquibase, MSSQL, Gitlab, Bash, Vmware, Grafan, Helm, Hashicorp Vault, OpenSearch, CNI, CSI.

02.2019-08.2020

ТЭМБР-Банк

Роль: DevOps

Задачи:

Создание/настройка инфраструктуры dev, preprod, prod окружений.

Управление системой мониторинга Zabbix.

Мониторинг серверного оборудования.

Администрирование домен контроллера, принт сервера, почтового сервера Exchange MDaemon, DHCP, создание групповых политик, администрирование сетевых хранилищ.

Настройка коммутаторов CISCO и 3COM/HP.

Установка специализированного банковского ПО.

Консультирование пользователей.

Обслуживание АТС банка, установка телефонов на рабочих местах (Цифровая и IP-телефония Avaya).

Обновление форм отчетности (Kliko).

Деплой компонентов продуктов на стенды тестирования.

Интеграция с системой мониторинга на dev и тестовых стендах.

Участие в разборе инцидентов, анализе причин их возникновения, выполнении работ по их предотвращению.

Настройка, развертывание и администрирование виртуальных машин для тестирования и продакшен сред.

Создание плейбуков для автоматизации развертывания и конфигурации серверов и приложений.

Управление состоянием инфраструктуры с использованием Ansible.

Установка и конфигурация системы мониторинга для сбора и хранения метрик.

Анализ метрик и настройка алертов для быстрого реагирования на аномалии. 

Настройка передачи логов в Elasticsearch или OpenSearch.

Создание индексов для эффективного поиска и анализа логов.

Разработка и внедрение процессов извлечения, преобразования и загрузки данных для анализа.

Администрирование и оптимизация баз данных Greenplum или PostgreSQL.

Настройка взаимодействия BI систем с базами данных для аналитики.

Поддержка и развертывание микросервисных компонентов и решение задач, связанных с интеграцией.

Настройка и управление облачным хранилищем, включая ClickHouse и ForeSight для аналитики и обработки данных.

Автоматизация процессов развертывания ПО, управление обновлениями и поддержание тестовых стендов.

Разработка и настройка протоколов аварийного восстановления для обеспечения отказоустойчивости.

Поддержка и администрирование систем, работающих в среде Astra Linux, если это требуется.

Используемые технологии: Linux, Active Directory, IPSec, SCCM, HSM, Liquibase, MSSQL, Gitlab, Bash, Vmware, Grafan, Ansible, VictoriaMetrics, Elasticsearch, ETL/ELT, PostgreSQL, ClickHouse, ForeSight, CI/CD, Astra Linux.

09.2015-02.2019

ФГБОУ МГТУ СТАНКИН

Роль: Инженер отдела системного администрирования и технической поддержки пользователей

Задачи:

Техническое обслуживание, ремонт, модернизация ПК (более 400).

Установка операционных систем (Windows 7, 8.1, 10) и ПО.

Установка и настройка специализированного ПО (SolidWorks, КриптоПРО, настройка ЭЦП).

Настройка на рабочих местах, техническое обслуживание и замена расходных материалов копировально-множительной техники.

Администрирование доменного контроллера (Windows Server 2012 R2, Windows Server 2016, SCCM).

Создание учетных записей пользователей в AD и ящиков электронной почты, настройка групповых политик.

Проведение закупок техники, комплектующих и расходных материалов (ФЗ-44, ФЗ-223).

Координирование работы технической поддержки (организация дежурств инженеров и техников, обработка заявок пользователей, распределение заявок на сотрудников отдела), исполнение обязанностей заместителя начальника отдела.

Составление отчетности о работе отдела.

Монтаж кабельной инфраструктуры сетей (прокладка и обжимка кабеля, прошивка патч-панелей, установка и настройка сетевого оборудования).

Используемые технологии: Linux, Active Directory, IPSec, SCCM, HSM, Liquibase, MSSQL, Gitlab, Bash, Vmware, Grafan.



`

const res5 = {
  "name": "Олег",
  "position": "DevOps-инженер",
  "grade": null,
  "age": null,
  "experience": "6 лет",
  "location": "Москва",
  "technologies": [
    "Ansible",
    "Terraform",
    "Liquibase",
    "Grafana",
    "Vmware",
    "Zabbix",
    "Kubernetes",
    "Helm",
    "Docker",
    "Jenkins",
    "OpenSearch",
    "Gitlab",
    "Git",
    "Hashicorp Vault",
    "Prometheus",
    "ArgoCD",
    "Kubernetes On-Prem BareMetal",
    "SCCM",
    "Kaspersky Security Center",
    "CNI",
    "CSI"
  ],
  "databases": [
    "PostgreSQL",
    "MongoDB",
    "MSSQL"
  ],
  "operatingSystems": [
    "Windows",
    "Linux"
  ],
  "webTechnologies": [],
  "devTools": [
    "Git",
    "Jenkins",
    "Docker",
    "Ansible"
  ],
  "programmingLanguages": [
    "Bash",
    "PowerShell",
    "Python"
  ],
  "languages": [],
  "personalInfo": {
    "gender": null,
    "birthday": null,
    "citizenship": "РФ",
    "workPermit": null,
    "relocation": null,
    "businessTrips": null
  },
  "education": [
    {
      "level": "Высшее",
      "year": 2018,
      "institution": "Московский государственный технологический университет \"Станкин\"",
      "specialization": "Автоматизации и робототехники, Мехатроника и робототехника"
    },
    {
      "level": "Высшее",
      "year": 2016,
      "institution": "Московский государственный технологический университет \"Станкин\"",
      "specialization": "Информационных технологий и систем управления, Мехатроника и робототехника"
    }
  ],
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "Разработка ПО",
      "description": "Сопровождение нагрузочного тестирования, поддержка стендов разработки.",
      "duration": "06.2024 – 01.2025 (7 месяцев)",
      "role": "DevOps-инженер",
      "duties": [
        "Развертывание и администрирование dev и тестовых стендов для обеспечения непрерывного процесса разработки.",
        "Получение и администрирование проектов k8s.",
        "Получение и администрирование виртуальных машин.",
        "Конфигурирование и администрирование БД.",
        "Настройка конвейера для поставки на стенд.",
        "Настройка и поддержка процесса DevOps, в т.ч. CI/CD процессов.",
        "Работа с Linux и развертывание там системы работы с Liquibase.",
        "Работа с MSSQL.",
        "Мониторинг производительности приложений и инфраструктуры с использованием Grafana.",
        "Создание и настройка панелей мониторинга для визуализации данных из различных источников.",
        "Интеграция Grafana с другими инструментами, такими как Prometheus, для сбора метрик.",
        "Управление виртуализацией и развертыванием приложений на платформе VMware.",
        "Конфигурация и оптимизация виртуальных машин для повышения производительности.",
        "Автоматизация процессов развертывания и управления инфраструктурой с использованием инструментов CI/CD.",
        "Обеспечение безопасности и управления доступом к ресурсам VMware.",
        "Анализ и отладка системы мониторинга для повышения надежности и доступности.",
        "Администрирование Gitlab репозиториев.",
        "Написание скриптов на Bash.",
        "Работа с Win/Linux системами.",
        "Участие в тестировании ПО, которое предоставляет компания.",
        "Развертывание с нуля Zabbix.",
        "Создание домена на базе Active Directory.",
        "Организация VPN-туннеля IPSec на базе Linux.",
        "Создание и настройка сервера SCCM.",
        "Администрирование SQL Server для SCCM.",
        "Администрирование Terminal Server.",
        "Сопровождение и поддержка пользователей."
      ],
      "technologiesUsed": [
        "Linux",
        "Active Directory",
        "IPSec",
        "SCCM",
        "Prometheus",
        "HSM",
        "Liquibase",
        "Kubernetes On-Prem BareMetal",
        "MSSQL",
        "Gitlab",
        "Bash",
        "Vmware",
        "Grafana",
        "Helm",
        "Hashicorp Vault",
        "ArgoCD",
        "OpenSearch",
        "CNI",
        "CSI"
      ]
    },
    {
      "name": "Завод пищевого производства",
      "description": "Сопровождение миграции пользователей между доменам Active Directory",
      "duration": "08.2020-06.2024 (3 года 10 месяцев)",
      "role": "DevOps",
      "duties": [
        "Создание/настройка инфраструктуры dev, preprod, prod окружений.",
        "Настройка и поддержка служб микросервисных приложений с помощью шаблонов Helm и Kubernetes.",
        "Выполнение задач, поставленных в Jira и Redmine.",
        "Работа в Confluence и WikiJS.",
        "Разработка и поддержка Kubernetes кластера на BareMetal.",
        "Настройка и управление сетевыми плагинами (CNI) и хранилищами данных (CSI).",
        "Создание и управление Helm-чартами для упрощения развертывания приложений.",
        "Автоматизация установки, обновления и удаления приложений в кластере Kubernetes.",
        "Управление секретами и конфиденциальной информацией.",
        "Настройка политик доступа и средств шифрования данных.",
        "Настройка системы мониторинга для сбора метрик приложений и инфраструктуры.",
        "Создание дашбордов и алертов для оперативного реагирования на проблемы.",
        "Настройка автоматизированных процессов развертывания приложений.",
        "Управление конфигурациями и версиями приложений с помощью GitOps.",
        "Настройка и поддержка системы для индексации и поиска логов.",
        "Анализ данных для выявления проблем и улучшения производительности приложений.",
        "Четкая координация между командами разработки и операциями для ускорения циклов разработки.",
        "Автоматизация повторяющихся задач для повышения эффективности.",
        "Администрирование Active Directory, принт сервера, почтового сервера (Exchange 2019, Exchange Online) в части создания/блокировки и аудита учетных записей сотрудников.",
        "Администрирование и аудит внутренних корпоративных систем.",
        "Написание инструкций по пользованию ПО и оборудованием для сотрудников ИТ отдела и обычных пользователей.",
        "Администрирование Kaspersky Security Center.",
        "Работа с продуктами 1С.",
        "Внедрение системы учёта ИТ оборудования на базе 1С Бухгалтерия - написание ТЗ для отдела разработки, выявление ошибок во время опытной эксплуатации системы.",
        "Обработка и маршрутизация обращений пользователей в системе HelpDesk (GLPI)."
      ],
      "technologiesUsed": [
        "Linux",
        "Active Directory",
        "Prometheus",
        "IPSec",
        "SCCM",
        "HSM",
        "Kubernetes On-Prem BareMetal",
        "Kubernetes",
        "ArgoCD",
        "Liquibase",
        "MSSQL",
        "Gitlab",
        "Bash",
        "Vmware",
        "Grafana",
        "Helm",
        "Hashicorp Vault",
        "OpenSearch",
        "CNI",
        "CSI"
      ]
    },
    {
      "name": "ТЭМБР-Банк",
      "description": "DevOps работы в банке.",
      "duration": "02.2019-08.2020 (1 год 6 месяцев)",
      "role": "DevOps",
      "duties": [
        "Создание/настройка инфраструктуры dev, preprod, prod окружений.",
        "Управление системой мониторинга Zabbix.",
        "Мониторинг серверного оборудования.",
        "Администрирование домен контроллера, принт сервера, почтового сервера Exchange MDaemon, DHCP, создание групповых политик, администрирование сетевых хранилищ.",
        "Настройка коммутаторов CISCO и 3COM/HP.",
        "Установка специализированного банковского ПО.",
        "Консультирование пользователей.",
        "Обслуживание АТС банка, установка телефонов на рабочих местах (Цифровая и IP-телефония Avaya).",
        "Обновление форм отчетности (Kliko).",
        "Деплой компонентов продуктов на стенды тестирования.",
        "Интеграция с системой мониторинга на dev и тестовых стендах.",
        "Участие в разборе инцидентов, анализе причин их возникновения, выполнении работ по их предотвращению.",
        "Настройка, развертывание и администрирование виртуальных машин для тестирования и продакшен сред.",
        "Создание плейбуков для автоматизации развертывания и конфигурации серверов и приложений.",
        "Управление состоянием инфраструктуры с использованием Ansible.",
        "Установка и конфигурация системы мониторинга для сбора и хранения метрик.",
        "Анализ метрик и настройка алертов для быстрого реагирования на аномалии.",
        "Настройка передачи логов в Elasticsearch или OpenSearch.",
        "Создание индексов для эффективного поиска и анализа логов.",
        "Разработка и внедрение процессов извлечения, преобразования и загрузки данных для анализа.",
        "Администрирование и оптимизация баз данных Greenplum или PostgreSQL.",
        "Настройка взаимодействия BI систем с базами данных для аналитики.",
        "Поддержка и развертывание микросервисных компонентов и решение задач, связанных с интеграцией.",
        "Настройка и управление облачным хранилищем, включая ClickHouse и ForeSight для аналитики и обработки данных.",
        "Автоматизация процессов развертывания ПО, управление обновлениями и поддержание тестовых стендов.",
        "Разработка и настройка протоколов аварийного восстановления для обеспечения отказоустойчивости.",
        "Поддержка и администрирование систем, работающих в среде Astra Linux, если это требуется."
      ],
      "technologiesUsed": [
        "Linux",
        "Active Directory",
        "IPSec",
        "SCCM",
        "HSM",
        "Liquibase",
        "MSSQL",
        "Gitlab",
        "Bash",
        "Vmware",
        "Grafana",
        "Ansible",
        "VictoriaMetrics",
        "Elasticsearch",
        "ETL/ELT",
        "PostgreSQL",
        "ClickHouse",
        "ForeSight",
        "CI/CD",
        "Astra Linux"
      ]
    },
    {
      "name": "ФГБОУ МГТУ СТАНКИН",
      "description": "Инженер отдела системного администрирования и технической поддержки пользователей.",
      "duration": "09.2015-02.2019",
      "role": "Инженер",
      "duties": [
        "Техническое обслуживание, ремонт, модернизация ПК (более 400).",
        "Установка операционных систем (Windows 7, 8.1, 10) и ПО.",
        "Установка и настройка специализированного ПО (SolidWorks, КриптоПРО, настройка ЭЦП).",
        "Настройка на рабочих местах, техническое обслуживание и замена расходных материалов копировально-множительной техники.",
        "Администрирование доменного контроллера (Windows Server 2012 R2, Windows Server 2016, SCCM).",
        "Создание учетных записей пользователей в AD и ящиков электронной почты, настройка групповых политик.",
        "Проведение закупок техники, комплектующих и расходных материалов (ФЗ-44, ФЗ-223).",
        "Координирование работы технической поддержки.",
        "Составление отчетности о работе отдела.",
        "Монтаж кабельной инфраструктуры сетей (прокладка и обжимка кабеля, прошивка патч-панелей, установка и настройка сетевого оборудования)."
      ],
      "technologiesUsed": [
        "Linux",
        "Active Directory",
        "IPSec",
        "SCCM",
        "HSM",
        "Liquibase",
        "MSSQL",
        "Gitlab",
        "Bash",
        "Vmware",
        "Grafana"
      ]
    }
  ]
}