export const text6 = `Александр М.

QA-инженер

ОБРАЗОВАНИЕ: 

Среднее профессиональное в области программирования в компьютерных системах, 09.2015 - 06.2018

ЯЗЫКИ: Английский - Intermediate

НАВЫКИ: Charles Proxy, Fiddler, Postman, Insomnia, DevTools, BrowserStack, Test IT, Allure, Swagger, SQL, Oracle, Toad, MS SQL Server, MySQL, Jira, Xray, Zephyr, Confluence, Figma, Kibana, Android Studio, Xcode, TeamCity, Apache Kafka, RabbitMQ, Git, GitHub, BitBucket

ИЗБРАННЫЕ ПРОЕКТЫ: 

NDA | ФИНТЕХ                                                                                                                                        12.2023 - 03.2025

















Charles Proxy, Fiddler, Postman, Insomnia, DevTools, Swagger, Oracle, Toad, Jira, Zephyr, Confluence, Figma  

Проект, направленный на оптимизацию процессов кредитного сопровождения юридических лиц. Платформа предназначена для автоматизации и упрощения процедур кредитного сопровождения корпоративных клиентов банка, обеспечивая высокую скорость обработки заявок, прозрачность операций и эффективное управление рисками.

- Проведение смоук, функционального, интеграционного и регрессионного тестирования

- Создание тест-кейсов, чек-листов и их актуализация в Jira Zephyr

- Локализация, оформление, заведение и мониторинг дефектов в Jira

- Тестирование баз данных (Oracle, Toad)

- Тестирование frontend части с помощью DevTools, работа с макетами в Figma 

- Проведение API-тестирования и создание коллекций (Postman, Insomnia, Swagger)

- Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)

- Работа в составе команды разработки по Scrum

- Взаимодействие с разработчиками и аналитиками в рамках тестирования

Команда проекта: 2 frontend разработчика, 2 backend разработчика, 2 QA-инженера, менеджер проекта, системный аналитик, бизнес-аналитик, UI/UX дизайнер 



NDA | ФИНТЕХ    			           04.2023 - 12.2023















Charles Proxy, Fiddler, Postman, Insomnia, Swagger, Jira, Xray, Confluence, Figma, Kibana, Android Studio, Xcode 

Проект ориентирован на модернизацию и расширение возможностей платежного модуля в мобильном приложении банка. Доработка реализована с целью повышения удобства и безопасности проведения платежей пользователями, а также увеличения скорости и точности выполнения транзакций. 

- Проведение смоук, функционального и интеграционного тестирования (Android Studio, Xcode)

- Создание тест-кейсов, чек-листов и их актуализация в Jira Xray

- Локализация, оформление, заведение и мониторинг дефектов в Jira

- Участие в проведении ПСИ

- Тестирование UI/UX, работа с макетами в Figma 

- Проведение API-тестирования и создание коллекций (Postman, Insomnia, Swagger)

- Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)

- Мониторинг логов с использованием Kibana

- Работа в составе команды разработки по Scrum

- Взаимодействие с разработчиками и аналитиками в рамках тестирования

Команда проекта: 2 Аndroid разработчика, 2 iOS разработчика, 4 backend разработчика, 4 QA-инженера, менеджер проекта, системный аналитик, бизнес-аналитик, UI/UX дизайнер



NDA | ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ  			          08.2022 - 04.2023















Charles Proxy, Fiddler, Postman, DevTools, Browserstack, Swagger, Jira, Confluence, Figma, Android Studio, Xcode, GitHub 

Семейство нативных VPN-приложений, разработанных для настольных компьютеров (Windows, macOS, Linux) и мобильных устройств (Android, iOS). Предоставляет возможность для пользователей защищать свои данные независимо от используемого устройства. 

- Проведение смоук, функционального, интеграционного и регрессионного тестирования (Android Studio, Xcode, Browserstack)

- Создание тест-кейсов, чек-листов, отчетов о тестировании 

- Локализация, оформление, заведение и мониторинг дефектов в Jira

- Тестирование frontend части с помощью DevTools, работа с макетами в Figma

- Проведение API-тестирования и создание коллекций (Postman, Swagger)

- Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)

- Работа в составе команды разработки по Kanban

- Взаимодействие с разработчиками и аналитиками в рамках тестирования

Команда проекта: 2 Аndroid разработчика, 2 iOS разработчика, 4 backend разработчика, 4 QA-инженера, менеджер проекта



NDA | ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ    			           03.2021 - 07.2022















Charles Proxy, Fiddler, Postman, Insomnia, DevTools, Swagger, Test IT, Allure, MS SQL Server, Jira, Confluence, TeamCity, BitBucket

Автоматизированная система обработки заявок, предназначенная для эффективного управления IT- и другими сервисными процессами в компаниях различного масштаба. Платформа представляет собой комплексное решение для оптимизации рабочих процессов, повышения качества обслуживания клиентов и масштабирования бизнеса.

- Проведение смоук, функционального и регрессионного тестирования

- Создание тест-кейсов, чек-листов и их актуализация в Test IT

- Локализация, оформление, заведение и мониторинг дефектов в Jira

- Анализ результатов автотестирования (Allure)

- Тестирование баз данных (MS SQL Server)

- Тестирование frontend части с помощью DevTools, работа с макетами в Figma 

- Проведение API-тестирования и создание коллекций (Postman, Insomnia, Swagger)

- Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)

- Работа в составе команды разработки по Scrum

- Взаимодействие с разработчиками и аналитиками в рамках тестирования

Команда проекта: 2 fullstack разработчика, 2 QA-инженера, менеджер проекта, системный аналитик, бизнес-аналитик



NDA | СТРАХОВАНИЕ    			           09.2020 - 03.2021















Charles Proxy, Fiddler, Postman, DevTools, Swagger, Figma, GitHub 

Проект, реализованный в области страхования, предназначен для обеспечения сохранности денежных средств вкладчиков банков и клиентов негосударственных пенсионных фондов (НПФ).

- Проведение смоук, функционального, интеграционного и регрессионного тестирования

- Создание тест-кейсов, чек-листов и их актуализация в GitHub

- Участие в проведении ПМИ 

- Локализация, оформление, заведение и мониторинг дефектов в GitHub

- Тестирование frontend части с помощью DevTools, работа с макетами в Figma

- Проведение API-тестирования и создание коллекций (Postman, Swagger)

- Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)

- Работа в составе команды разработки по Scrum

- Взаимодействие с разработчиками и аналитиками в рамках тестирования

Команда проекта: 2 fullstack разработчика, 3 QA-инженера, менеджер проекта, системный аналитик, UI/UX дизайнер

`

export const res6 = {
  "name": "Александр М.",
  "position": "QA-инженер",
  "grade": null,
  "age": null,
  "experience": "от 2018 до настоящего времени",
  "location": null,
  "technologies": [
    "Charles Proxy",
    "Fiddler",
    "Postman",
    "Insomnia",
    "DevTools",
    "BrowserStack",
    "Test IT",
    "Allure",
    "Swagger",
    "Jira",
    "Xray",
    "Zephyr",
    "Confluence",
    "Figma",
    "Kibana",
    "Android Studio",
    "Xcode",
    "TeamCity",
    "Apache Kafka",
    "RabbitMQ",
    "Git",
    "GitHub",
    "BitBucket"
  ],
  "databases": [
    "Oracle",
    "Toad",
    "MS SQL Server",
    "MySQL"
  ],
  "operatingSystems": [],
  "webTechnologies": [],
  "devTools": [],
  "programmingLanguages": [],
  "languages": [
    {
      "level": "Intermediate",
      "name": "Английский"
    }
  ],
  "personalInfo": {
    "gender": null,
    "birthday": null,
    "citizenship": null,
    "workPermit": null,
    "relocation": null,
    "businessTrips": null
  },
  "education": {
    "level": "Среднее профессиональное",
    "year": 2018,
    "institution": null,
    "specialization": "программирования в компьютерных системах"
  },
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "NDA | ФИНТЕХ",
      "description": "Проект, направленный на оптимизацию процессов кредитного сопровождения юридических лиц. Платформа предназначена для автоматизации и упрощения процедур кредитного сопровождения корпоративных клиентов банка, обеспечивая высокую скорость обработки заявок, прозрачность операций и эффективное управление рисками.",
      "duration": "12.2023 - 03.2025 (1 год 2 месяца)",
      "role": "QA-инженер",
      "duties": [
        "Проведение смоук, функционального, интеграционного и регрессионного тестирования",
        "Создание тест-кейсов, чек-листов и их актуализация в Jira Zephyr",
        "Локализация, оформление, заведение и мониторинг дефектов в Jira",
        "Тестирование баз данных (Oracle, Toad)",
        "Тестирование frontend части с помощью DevTools, работа с макетами в Figma",
        "Проведение API-тестирования и создание коллекций (Postman, Insomnia, Swagger)",
        "Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)",
        "Работа в составе команды разработки по Scrum",
        "Взаимодействие с разработчиками и аналитиками в рамках тестирования"
      ],
      "technologiesUsed": [
        "Charles Proxy",
        "Fiddler",
        "Postman",
        "Insomnia",
        "DevTools",
        "Swagger",
        "Oracle",
        "Toad",
        "Jira",
        "Zephyr",
        "Confluence",
        "Figma"
      ]
    },
    {
      "name": "NDA | ФИНТЕХ",
      "description": "Проект ориентирован на модернизацию и расширение возможностей платежного модуля в мобильном приложении банка. Доработка реализована с целью повышения удобства и безопасности проведения платежей пользователями, а также увеличения скорости и точности выполнения транзакций.",
      "duration": "04.2023 - 12.2023 (8 месяца)",
      "role": "QA-инженер",
      "duties": [
        "Проведение смоук, функционального и интеграционного тестирования (Android Studio, Xcode)",
        "Создание тест-кейсов, чек-листов и их актуализация в Jira Xray",
        "Локализация, оформление, заведение и мониторинг дефектов в Jira",
        "Участие в проведении ПСИ",
        "Тестирование UI/UX, работа с макетами в Figma",
        "Проведение API-тестирования и создание коллекций (Postman, Insomnia, Swagger)",
        "Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)",
        "Мониторинг логов с использованием Kibana",
        "Работа в составе команды разработки по Scrum",
        "Взаимодействие с разработчиками и аналитиками в рамках тестирования"
      ],
      "technologiesUsed": [
        "Charles Proxy",
        "Fiddler",
        "Postman",
        "Insomnia",
        "Swagger",
        "Jira",
        "Xray",
        "Confluence",
        "Figma",
        "Kibana",
        "Android Studio",
        "Xcode"
      ]
    },
    {
      "name": "NDA | ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ",
      "description": "Семейство нативных VPN-приложений, разработанных для настольных компьютеров (Windows, macOS, Linux) и мобильных устройств (Android, iOS). Предоставляет возможность для пользователей защищать свои данные независимо от используемого устройства.",
      "duration": "08.2022 - 04.2023 (8 месяцев)",
      "role": "QA-инженер",
      "duties": [
        "Проведение смоук, функционального, интеграционного и регрессионного тестирования (Android Studio, Xcode, Browserstack)",
        "Создание тест-кейсов, чек-листов, отчетов о тестировании",
        "Локализация, оформление, заведение и мониторинг дефектов в Jira",
        "Тестирование frontend части с помощью DevTools, работа с макетами в Figma",
        "Проведение API-тестирования и создание коллекций (Postman, Swagger)",
        "Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)",
        "Работа в составе команды разработки по Kanban",
        "Взаимодействие с разработчиками и аналитиками в рамках тестирования"
      ],
      "technologiesUsed": [
        "Charles Proxy",
        "Fiddler",
        "Postman",
        "DevTools",
        "Browserstack",
        "Swagger",
        "Jira",
        "Confluence",
        "Figma",
        "Android Studio",
        "Xcode",
        "GitHub"
      ]
    },
    {
      "name": "NDA | ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ",
      "description": "Автоматизированная система обработки заявок, предназначенная для эффективного управления IT- и другими сервисными процессами в компаниях различного масштаба. Платформа представляет собой комплексное решение для оптимизации рабочих процессов, повышения качества обслуживания клиентов и масштабирования бизнеса.",
      "duration": "03.2021 - 07.2022 (1 год 4 месяца)",
      "role": "QA-инженер",
      "duties": [
        "Проведение смоук, функционального и регрессионного тестирования",
        "Создание тест-кейсов, чек-листов и их актуализация в Test IT",
        "Локализация, оформление, заведение и мониторинг дефектов в Jira",
        "Анализ результатов автотестирования (Allure)",
        "Тестирование баз данных (MS SQL Server)",
        "Тестирование frontend части с помощью DevTools, работа с макетами в Figma",
        "Проведение API-тестирования и создание коллекций (Postman, Insomnia, Swagger)",
        "Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)",
        "Работа в составе команды разработки по Scrum",
        "Взаимодействие с разработчиками и аналитиками в рамках тестирования"
      ],
      "technologiesUsed": [
        "Charles Proxy",
        "Fiddler",
        "Postman",
        "Insomnia",
        "DevTools",
        "Swagger",
        "Test IT",
        "Allure",
        "MS SQL Server",
        "Jira",
        "Confluence",
        "TeamCity",
        "BitBucket"
      ]
    },
    {
      "name": "NDA | СТРАХОВАНИЕ",
      "description": "Проект, реализованный в области страхования, предназначен для обеспечения сохранности денежных средств вкладчиков банков и клиентов негосударственных пенсионных фондов (НПФ).",
      "duration": "09.2020 - 03.2021 (6 месяцев)",
      "role": "QA-инженер",
      "duties": [
        "Проведение смоук, функционального, интеграционного и регрессионного тестирования",
        "Создание тест-кейсов, чек-листов и их актуализация в GitHub",
        "Участие в проведении ПМИ",
        "Локализация, оформление, заведение и мониторинг дефектов в GitHub",
        "Тестирование frontend части с помощью DevTools, работа с макетами в Figma",
        "Проведение API-тестирования и создание коллекций (Postman, Swagger)",
        "Мониторинг трафика HTTP/HTTPS запросов (Charles Proxy, Fiddler)",
        "Работа в составе команды разработки по Scrum",
        "Взаимодействие с разработчиками и аналитиками в рамках тестирования"
      ],
      "technologiesUsed": [
        "Charles Proxy",
        "Fiddler",
        "Postman",
        "DevTools",
        "Swagger",
        "Figma",
        "GitHub"
      ]
    }
  ]
}