const text7 = `

Болотов Александр

Мужчина

Проживает: Москва

Гражданство: Россия, есть разрешение на работу: Россия Не готов к переезду, готов к редким командировкам



Желаемая должность и зарплата	

QA Manual

Специализации:

— Тестировщик

Занятость: полная занятость, частичная занятость, проектная работа

График работы: полный день, сменный график, гибкий график, удаленная работа Желательное время в пути до работы: не имеет значения



Опыт работы — 4 года 2 месяца	



Июнь 2024 —

Февраль 2025

2 года 8 месяцев







































Июнь 2023 —

Май 2024

5 месяцев

Ао Расчетные Решения (Сбербанк)

Москва, ao-rr.ru/

Инженер по тестированию (manual)

Проекты:

Социальный процессинг

www.ao-rr.ru/socproc

Транспорт Регионы и МО

www.ao-rr.ru/projects/transport

Функциональное, регрессионное и приемочное тестирование продукта

Внешнее интеграционное тестирование

Обновление тестовой документации

Работа в команде (c PM и аутсорсной командой разработки)

Постановка задач на доработку

Участие в демонстрации и внедрении продукта для заказчика

Создание аналитических отчетов

Сопровождение продукта и разбор инцидентов

Замена PM на период командировок и отпусков

Яндекс

Москва, yandex.ru/jobs/

Инженер по тестированию (manual)

Инженер по тестированию в финансовом департаменте

Проект OEBS - Oracle E-Business Suite. Кастомная ERP-система в области финансов, бюджетирования, логистики, работа с базами данных и хранимыми процедурами.

Комплексное тестирование приложения:

функциональные, регрессионные и исследовательские тесты

Планирование и проектирование тестовых сценариев



Создание и поддержка тестовой документации

Автоматизация SQL тестов

Регулярные задачи - работа с SQl, CI/CD 





Январь 2022 —

Июнь 2023

9 месяцев











































Май 2020 —

Декабрь 2021

1 год 8 месяцев

Click2Money

Сербия, click2.money/

Ведущий инженер по тестированию (manual)

Тестирование продуктов:

Партнерская CPA-сеть (Afina, Let it Cash)

Платформа Esports (Evergaming)

Тестирование веба на мобильных устройствах (iOS+Android) и десктопное тестирование;

Функциональное, нефункциональное, интеграционное, нагрузочное тестирование, регресс, тестирование верстки, локализации

Тестирование API

Заведение баг-репортов и контроль их исправления

Внесение предложений по улучшению ПО

Работа с базой данных

Перенос и обновление тестовой документации

Взаимодействие с бизнесом по обеспечению качества продукта

Руководство командой тестирования (3 сотрудника)

Менторство над новичками

Выстраивание процессов и тестирования и распределение задач

Согласования сроков релиза в соответствии с роадмапой проектов

ООО Арциус

Москва, medpoint24.ru/

Медицина, фармацевтика, аптеки

Лечебно-профилактические учреждения Информационные технологии, системная интеграция, интернет

Системная интеграция, автоматизации технологических и бизнес-процессов предприятия, ИТ-консалтинг

Инженер по тестированию (manual)

прием, регистрация, эскалация, решение инцидентов, проблем пользователей;

Мониторинг Zabbix;

Устранение проблем в работе или настройка оборудования;

Выполнение административных и прочих заявок в crm;

Заведение багов в jira;

Решение вопросов с поставщиками услуг (провайдеры и операторы);

Обучение пользователей клиента работе с продуктом;

Пополнение базы знаний





Образование	 Неоконченное высшее

2017	Московский государственный технический университет им. Н.Э. Баумана, Москва

Факультет фундаментальных наук, Прикладная математика



Навыки



Знание языков	Русский — Родной

Английский — C1 — Продвинутый Немецкий — A2 — Элементарный



Навыки	 Atlassian Jira 	Функциональное тестирование	 Postman 	 PostgreSQL 

 Swagger 	 Atlassian Confluence 	 QA 	 Kibana 	 REST 	 XML 	 JSON 

 SOAP 	 Charles 	 SQL 	 Allure 	 Jenkins 	 Oracle DB 	 Oracle Pl/SQL 

 Python 	 Pytest 	 Selenium 	Управление командой	 Git 	 Gitlab 

Системный анализ	 BDD 	Ручное тестирование	 Apache Kafka 	 RabbitMQ 

 Docker 



Дополнительная информация	

Обо мне	Работал над крупными финтех проектами, а также более мелкими стартапами на базе Сколково.Работа в крупных командах (более 50 человек), а также в малых, в том числе в качестве лидера, а также с аутсорс подрядчиками.

Мой стек:

Базы данных: PostrgeSQL, Oracle, PL/SQL API: REST SOAP

Языки программирования: Python

ОС: Windows, MacOS, CentOS

Документация: Qase.io, Confluence, TestPalm, Allure, Yandex TMS

Инструменты: Postman, Swagger, Devtools, Jenkins, Gitlab, Figma, Kibana, Kafka, Rabbit





`

const res7 = {
  "name": "Болотов Александр",
  "position": "QA Manual",
  "grade": "Middle+",
  "age": null,
  "experience": "4 года 2 месяца",
  "location": "Москва",
  "technologies": [
    "Atlassian Jira",
    "Postman",
    "Swagger",
    "Kibana",
    "REST",
    "XML",
    "JSON",
    "SOAP",
    "Charles",
    "Allure",
    "Jenkins",
    "Docker"
  ],
  "databases": [
    "PostgreSQL",
    "Oracle",
    "Oracle DB",
    "PL/SQL"
  ],
  "operatingSystems": [
    "Windows",
    "MacOS",
    "CentOS"
  ],
  "webTechnologies": [],
  "devTools": [
    "Git",
    "Gitlab",
    "Figma"
  ],
  "programmingLanguages": [
    "Python"
  ],
  "languages": [
    {
      "level": "C1",
      "name": "Английский"
    },
    {
      "level": "A2",
      "name": "Немецкий"
    }
  ],
  "personalInfo": {
    "gender": "Мужчина",
    "birthday": null,
    "citizenship": "Россия",
    "workPermit": "Россия",
    "relocation": "Не готов к переезду",
    "businessTrips": "готов к редким командировкам"
  },
  "education": {
    "level": "Неоконченное высшее",
    "year": 2017,
    "institution": "Московский государственный технический университет им. Н.Э. Баумана",
    "specialization": "Прикладная математика"
  },
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "Ао Расчетные Решения (Сбербанк)",
      "description": ` - Социальный процессинг www.ao-rr.ru/socproc
          - Транспорт Регионы и МО
www.ao-rr.ru/projects/transport
      `,
      "duration": "06.2024 - 02.2025",
      "role": "Инженер по тестированию (manual)",
      "duties": [
        "Внешнее интеграционное тестирование",
        "Обновление тестовой документации",
        "Работа в команде (c PM и аутсорсной командой разработки)",
        "Постановка задач на доработку",
        "Участие в демонстрации и внедрении продукта для заказчика",
        "Создание аналитических отчетов",
        "Сопровождение продукта и разбор инцидентов",
        "Замена PM на период командировок и отпусков"
      ],
      "technologiesUsed": []
    },
    {
      "name": "Яндекс",
      "description": "Проект OEBS - Oracle E-Business Suite. Кастомная ERP-система в области финансов, бюджетирования, логистики, работа с базами данных и хранимыми процедурами.",
      "duration": "01.2022 - 06.2023",
      "role": "Инженер по тестированию (manual)",
      "duties": [
        "Комплексное тестирование приложения",
        "Планирование и проектирование тестовых сценариев",
        "Создание и поддержка тестовой документации",
        "Автоматизация SQL тестов",
        "Регулярные задачи - работа с SQl, CI/CD"
      ],
      "technologiesUsed": [
        "SQl",
        "CI/CD"
      ]
    },
    {
      "name": "Click2Money",
      "description": `Тестирование продуктов:
Партнерская CPA-сеть (Afina, Let it Cash)
Платформа Esports (Evergaming)`,
      "duration": "05.2020 - 12.2021",
      "role": "Ведущий инженер по тестированию (manual)",
      "duties": [
        "Тестирование веба на мобильных устройствах (iOS+Android) и десктопное тестирование",
        "Функциональное, нефункциональное, интеграционное, нагрузочное тестирование",
        "Тестирование API",
        "Заведение баг-репортов и контроль их исправления",
        "Внесение предложений по улучшению ПО",
        "Работа с базой данных",
        "Перенос и обновление тестовой документации",
        "Взаимодействие с бизнесом по обеспечению качества продукта",
        "Руководство командой тестирования (3 сотрудника)",
        "Менторство над новичками",
        "Выстраивание процессов и тестирования и распределение задач",
        "Согласования сроков релиза в соответствии с роадмапой проектов"
      ],
      "technologiesUsed": []
    },
    {
      "name": "ООО Арциус",
      "description": `Медицина, фармацевтика, аптеки
        ◦ Лечебно-профилактические учреждения Информационные технологии, системная интеграция, интернет
        ◦ Системная интеграция, автоматизации технологических и бизнес-процессов предприятия, ИТ-консалтинг`,
      "duration": null,
      "role": "Инженер по тестированию (manual)",
      "duties": [
        "прием, регистрация, эскалация, решение инцидентов, проблем пользователей",
        "Мониторинг Zabbix",
        "Устранение проблем в работе или настройка оборудования",
        "Выполнение административных и прочих заявок в crm",
        "Заведение багов в jira",
        "Решение вопросов с поставщиками услуг (провайдеры и операторы)",
        "Обучение пользователей клиента работе с продуктом",
        "Пополнение базы знаний"
      ],
      "technologiesUsed": []
    }
  ]
}