export const text8 = `	





Алексей Л.QA engineer

Комментарий HR:

5 лет опыта в тестировании программного обеспечения, включая функциональное и нефункциональное тестирование мобильных и веб-приложений. Специализируется на разработке тестовой документации, анализе требований и улучшении пользовательского опыта (UX/UI). Глубокие навыки работы с инструментами Jira, Confluence, TestRail, Postman и SQL. Опыт работы в Agile-среде (Scrum, Kanban).



Локация / гражданство



Москва / Россия



Образование



2008, Казанский государственный университет, КазаньПсихологии, Бакалавриат



Иностранные языки	



Английский - В2



Навыки	



Jira, Confluence 

TestRail

API, Postman 

DevTools

SQL 

Git 

Agile (Scrum, Kanban)

UX / UI, Figma 

Miro

Тестовая документация (чек-листы, тест-кейсы)

Анализ требований

Понимание процесса разработки ПО





Опыт работы

LMS 

QA Engineer

Декабрь 2023 - по настоящее время



Длительность: 1 год.



Описание: система управления обучением крупнейшего банка и нефтяной компании.													

Обязанности:

Тестирование нового функционала, компонентов story-book, макетов UX/UI нового функционала;

Тестирование требований;

Создание тестовой документации по еще не реализованному функционалу;

Непосредственное участие в разработке нового функционала, внесение предложений по улучшению продукта (UX\UI, логика, бизнес- и клиентоориентированность).



Стек: Jira, Confluence, Zefir, Swagger, Postman, Hasura, BrowserStack, adb, Charles, TestFly, Grafana, Zabbix, Lens, Kubernetes, Docker.



NDA

QA Engineer

Январь 2022 — ноябрь 2023



Длительность: 1 год 10 месяцев.



Описание: fintech-проект международных переводов, электронных кошельков и платежных карт.														

Обязанности:

Функциональное и нефункциональное тестирование приложений на Android, iOs, WEB - тестирование партнерских интеграций (KYC, sms например);

Разработка и поддержание тест-кейсов;

Тестирование новых платежных операторов и платежей;

Настройка прайсинга, даш-борда;

Написание инструкций для партнёров, ТЗ для разработчиков;

Разработка и внедрение новых фич, обсуждение и доказательство их необходимости перед владельцем продукта (Product Owner);

Тестирование локализаций, UX/UI, в том числе для "правосторонних" языков;

Работа с бета-тестировщиками;

Приемка разработанного функционала;

Предрелизное тестирование, выпуск в релиз (PlayMarket, AppStore);

За время работы подготовил к релизу новое приложение на Android, iOS, а также новый сайт компании.



Стек: Jira, TestRail, Postman, Swagger, Android Studio, Xcode, SAP



NDA

QA Engineer

Сентябрь 2021 — декабрь 2022



Длительность: 1 год 4 месяца.



Описание: подразделение системы электронных кошельков, платежей, терминалов в Восточной Европе и Северной Африке.

													

Обязанности:

Самостоятельное функциональное и нефункциональное тестирование двух Android-приложений, нескольких сайтов (для юр и физлиц), WEB-клиентов, платежных терминалов;

Приемочное, регрессионное, интеграционное, локализационное, смоук-, исследовательское тестирование, пользовательского поведения, UX-UI-тесты, локализаций и др.;

Нахождение багов, уязвимостей и улучшений (функциональных и нефункциональных), оформление в Jira, контроль исправлений;

Описание и внедрение новых функциональных и нефункциональных возможностей ("фич") для используемых систем, написание ТЗ;

Разработка тест-планов и тест-кейсов, заведение в TestRail;

Разработка, описание и тестирование требований к функционалу (новому и старому);

Аналитика пользовательских кейсов, выход за рамки стандартного тестирования;

Создание и актуализация базы знаний в корпоративной wiki;

Ревью тестовой документации коллег;

С февраля - аналитика развития компании в РФ, мониторинг рынка конкурентов, предоставление рекомендаций руководству;

Работа спринтами в условиях нехватки информации и отсутствия документации.



Стек: Jira, TestRail, SQL, Miro.



Amsalem

QA Engineer

Октябрь 2020 — август 2021



Длительность: 11 месяцев.



Описание: медподразделение международной компании бизнес-туризма.											

Обязанности:

Функциональное тестирование Windows-приложения CRM-системы; 

Тестирование ролей доступа;

Выявление уязвимостей;

UX/UI-, smoke-тестирование;

Документирование выявленных багов и найденных улучшений; 

Ручной перенос персональных данных клиентов в новую CRM;

Оперативная обратная связь разработчикам для исправлений.



Стек: Jira, TestRail, Postman, Figma, DevTools.



Maximarkets

QA Engineer

Октябрь 2019 — Сентябрь 2020



Длительность: 1 год.



Описание: международная финтех компания.					



Обязанности:

Поддержка пользователей финансовой системы в чате и с помощью аудиосвязи; 

Тестирование Android-приложения и WEB-сайта, выявление багов;

Отчетность в CRM;

Рекомендации исправлений тим-лиду.



Стек: Jira, TestRail, Android Studio, DevTools.



`

export const res8 = {
  "name": "Алексей Л.",
  "position": "QA engineer",
  "grade": null,
  "age": null,
  "experience": "5 лет",
  "location": "Москва / Россия",
  "technologies": [
    "Jira",
    "Confluence",
    "TestRail",
    "Postman",
    "SQL",
    "Git",
    "Figma",
    "Miro"
  ],
  "databases": [],
  "operatingSystems": [],
  "webTechnologies": [],
  "devTools": [
    "DevTools",
    "Swagger",
    "Android Studio",
    "Xcode"
  ],
  "programmingLanguages": [],
  "languages": [
    {
      "level": "B2",
      "name": "английский"
    }
  ],
  "personalInfo": {
    "gender": null,
    "birthday": null,
    "citizenship": "Россия",
    "workPermit": null,
    "relocation": null,
    "businessTrips": null
  },
  "education": {
    "level": "Бакалавриат",
    "year": 2008,
    "institution": "Казанский государственный университет",
    "specialization": "Психология"
  },
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "LMS",
      "description": "система управления обучением крупнейшего банка и нефтяной компании.",
      "duration": "Декабрь 2023 - н.в. (1 год)",
      "role": "QA Engineer",
      "duties": [
        "Тестирование нового функционала, компонентов story-book, макетов UX/UI нового функционала",
        "Тестирование требований",
        "Создание тестовой документации по еще не реализованному функционалу",
        "Непосредственное участие в разработке нового функционала, внесение предложений по улучшению продукта (UX\\UI, логика, бизнес- и клиентоориентированность)"
      ],
      "technologiesUsed": [
        "Jira",
        "Confluence",
        "Zefir",
        "Swagger",
        "Postman",
        "Hasura",
        "BrowserStack",
        "adb",
        "Charles",
        "TestFly",
        "Grafana",
        "Zabbix",
        "Lens",
        "Kubernetes",
        "Docker"
      ]
    },
    {
      "name": "NDA",
      "description": "fintech-проект международных переводов, электронных кошельков и платежных карт.",
      "duration": "Январь 2022 — ноябрь 2023 (1 год 10 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Функциональное и нефункциональное тестирование приложений на Android, iOs, WEB - тестирование партнерских интеграций (KYC, sms например)",
        "Разработка и поддержание тест-кейсов",
        "Тестирование новых платежных операторов и платежей",
        "Настройка прайсинга, даш-борда",
        "Написание инструкций для партнёров, ТЗ для разработчиков",
        "Разработка и внедрение новых фич, обсуждение и доказательство их необходимости перед владельцем продукта (Product Owner)",
        "Тестирование локализаций, UX/UI, в том числе для 'правосторонних' языков",
        "Работа с бета-тестировщиками",
        "Приемка разработанного функционала",
        "Предрелизное тестирование, выпуск в релиз (PlayMarket, AppStore)",
        "За время работы подготовил к релизу новое приложение на Android, iOS, а также новый сайт компании"
      ],
      "technologiesUsed": [
        "Jira",
        "TestRail",
        "Postman",
        "Swagger",
        "Android Studio",
        "Xcode",
        "SAP"
      ]
    },
    {
      "name": "NDA",
      "description": "подразделение системы электронных кошельков, платежей, терминалов в Восточной Европе и Северной Африке.",
      "duration": "Сентябрь 2021 — декабрь 2022 (1 год 4 месяца)",
      "role": "QA Engineer",
      "duties": [
        "Самостоятельное функциональное и нефункциональное тестирование двух Android-приложений, нескольких сайтов (для юр и физлиц), WEB-клиентов, платежных терминалов",
        "Приемочное, регрессионное, интеграционное, локализационное, смоук-, исследовательское тестирование, пользовательского поведения, UX-UI-тесты, локализаций и др.",
        "Нахождение багов, уязвимостей и улучшений (функциональных и нефункциональных), оформление в Jira, контроль исправлений",
        "Описание и внедрение новых функциональных и нефункциональных возможностей ('фич') для используемых систем, написание ТЗ",
        "Разработка тест-планов и тест-кейсов, заведение в TestRail",
        "Разработка, описание и тестирование требований к функционалу (новому и старому)",
        "Аналитика пользовательских кейсов, выход за рамки стандартного тестирования",
        "Создание и актуализация базы знаний в корпоративной wiki",
        "Ревью тестовой документации коллег",
        "С февраля - аналитика развития компании в РФ, мониторинг рынка конкурентов, предоставление рекомендаций руководству",
        "Работа спринтами в условиях нехватки информации и отсутствия документации"
      ],
      "technologiesUsed": [
        "Jira",
        "TestRail",
        "SQL",
        "Miro"
      ]
    },
    {
      "name": "Amsalem",
      "description": "медподразделение международной компании бизнес-туризма.",
      "duration": "Октябрь 2020 — август 2021 (11 месяцев)",
      "role": "QA Engineer",
      "duties": [
        "Функциональное тестирование Windows-приложения CRM-системы",
        "Тестирование ролей доступа",
        "Выявление уязвимостей",
        "UX/UI-, smoke-тестирование",
        "Документирование выявленных багов и найденных улучшений",
        "Ручной перенос персональных данных клиентов в новую CRM",
        "Оперативная обратная связь разработчикам для исправлений"
      ],
      "technologiesUsed": [
        "Jira",
        "TestRail",
        "Postman",
        "Figma",
        "DevTools"
      ]
    },
    {
      "name": "Maximarkets",
      "description": "международная финтех компания.",
      "duration": "Октябрь 2019 — Сентябрь 2020 (1 год)",
      "role": "QA Engineer",
      "duties": [
        "Поддержка пользователей финансовой системы в чате и с помощью аудиосвязи",
        "Тестирование Android-приложения и WEB-сайта, выявление багов",
        "Отчетность в CRM",
        "Рекомендации исправлений тим-лиду"
      ],
      "technologiesUsed": [
        "Jira",
        "TestRail",
        "Android Studio",
        "DevTools"
      ]
    }
  ]
}