const text9 = `Петр Н.



Senior Frontend developer



Общий опыт разработки более 6-ти лет



Навыки

Vue

JavaScript

Git

CSS

CSS3

HTML

HTML5

Node.js

REST API

SASS

ESLint

Figma

Redux

ReduxToolkit

react-testing-library

Webpack

API

BEM

NPM

Nuxt

Gitlab

Vite

Prettier 

JEST

Storybook

Опыт

работы

Февраль 2024 – Февраль 2025

Мосбиржа ("Личный кабинет участника" (ЛКУ))

Оценка и декомпозиция задач, оценка сложности и сроков выполнения

Разработка новых компонентов, написание их логики в соответствии с бизнес-требованиями и дизайном

Правка и адаптация имеющихся компонентов под обновлённые Требования бизнес-логики/дизайна

Написанием юнит-тестов для компонентов

Написанием юнит-тестов для служебных утилит

Взаимодействие с аналитиками и представителями бизнеса

Используемый стек: JavaScript, TypeScript, Git, HTML, CSS, VueJS, Nuxt, Jest, Vite.





Сентябрь 2023 – Февраль 2024

Админ панель для криптобиржи

Создание и поддержка дашборда: создание страницы по макетам, подключение запросов, фильтрация, роутинг

Разработка и интеграция админ-панели с расчетом gas fees,

комиссией и работой с протоколами токенов в DeFi.

Подключение кошельков Web3 (Metamask, TW)

Обработка нескольких протоколов с серверными данными

Ликвидность пулов AMM / Цена LP



Используемый стек: JavaScript, TypeScript. Vue.js, CoreUI, Vuex, Web3, Ether.js, Git, HTML, CSS, Prettier, ESLint.





Октябрь 2022 – Август 2023

Приложение для логистики грузоперевозок по Северной Америке



Реализация новых функций веб-приложения

Исправление ошибок

Анализ всего продукта в целом с последующим предложением

Улучшений самого продукта и процесса разработки

Код-ревью внутри команды

Внедрение юнит-тестов



Используемый стек: VueJS, Nuxt, Typescript, Vite, Vitest, SASS, HTML, Babel, ESlint, Figma, NPM, Gitlab/Gitlab CI, PCI DSS.





Март 2021 — Октябрь 2022Внутренняя админ-панель для сотрудников M.Video

Ревью код коллег

Настраивал Gitlab CI

Настройка и добавление компонентов в Storybook

Оптимизация производительности интерфейса для быстрой загрузки и отзывчивости

Создание новых интерактивных элементов, таких как формы, модальные окна

Разработка новых разделов админки

Написание SSR части приложения

Создание новых компонентов с нуля из Figma



Используемый стек: VueJS, Nuxt, Typescript, Webpack, SCSS, HTML, Babel, ESlint, Figma, Yarn, Handlebars





Январь 2020 — Март 2021

Контентно-ориентированное CMS

Внедрение и наглядная демонстрация улучшения прогнозируемости работы команды

Рaзpaбoткa новых разделов CMS, разработка UI-kit'a

Написание SSR части приложения

Создание сложнейших таблиц с нуля

Внедрение практики написания unit- и e2e-тестов

Разработка и формализация методики оценки задач



Используемый стек: VueJS 2, AngularJS, Typescript, Webpack, CSS, HTML, ESlint, Figma, NPM, Gitlab/Gitlab CI, Babel





Июль 2017 — Январь 2020

Проект ERP для ресторанов Северной Америки

Самостоятельная настройка Webpack.

Уменьшение размера бандла.

Рaзpaбoткa нового функционала, устранение имеющихся

Настройка Webpack для проекта

Построение компонентов на основе Kendo-UI+ VueJS

Написание прокси-mock'aльщика backend'a,

Правка drag and Drop вычислений

Используемый стек: VueJS, Kendo-UI, JavaScript, Webpack, CSS, HTML, NPM

Прочее 

Английский язык:С1





`

const res = {
  "name": "Петр Н.",
  "position": "Senior Frontend developer",
  "grade": null,
  "age": null,
  "experience": "более 6-ти лет",
  "location": null,
  "technologies": [
    "Vue",
    "JavaScript",
    "Git",
    "CSS",
    "CSS3",
    "HTML",
    "HTML5",
    "Node.js",
    "REST API",
    "SASS",
    "ESLint",
    "Figma",
    "Redux",
    "ReduxToolkit",
    "react-testing-library",
    "Webpack",
    "API",
    "BEM",
    "NPM",
    "Nuxt",
    "Gitlab",
    "Vite",
    "Prettier",
    "JEST",
    "Storybook"
  ],
  "databases": [],
  "operatingSystems": [],
  "webTechnologies": [],
  "devTools": [],
  "programmingLanguages": [],
  "languages": [
    {
      "level": "C1",
      "name": "Английский язык"
    }
  ],
  "personalInfo": {
    "gender": null,
    "birthday": null,
    "citizenship": null,
    "workPermit": null,
    "relocation": null,
    "businessTrips": null
  },
  "education": {
    "level": null,
    "year": null,
    "institution": null,
    "specialization": null
  },
  "certificates": [],
  "courses": [],
  "projects": [
    {
      "name": "Мосбиржа",
      "description": "Личный кабинет участника (ЛКУ)",
      "duration": "02.2024 - 02.2025 (1 год)",
      "role": "Разработчик",
      "duties": [
        "Оценка и декомпозиция задач, оценка сложности и сроков выполнения",
        "Разработка новых компонентов, написание их логики в соответствии с бизнес-требованиями и дизайном",
        "Правка и адаптация имеющихся компонентов под обновлённые Требования бизнес-логики/дизайна",
        "Написанием юнит-тестов для компонентов",
        "Написанием юнит-тестов для служебных утилит",
        "Взаимодействие с аналитиками и представителями бизнеса"
      ],
      "technologiesUsed": [
        "JavaScript",
        "TypeScript",
        "Git",
        "HTML",
        "CSS",
        "VueJS",
        "Nuxt",
        "Jest",
        "Vite"
      ]
    },
    {
      "name": "NDA",
      "description": "Админ панель для криптобиржи",
      "duration": "09.2023 - 02.2024 (6 месяцев)",
      "role": "Разработчик",
      "duties": [
        "Создание и поддержка дашборда: создание страницы по макетам, подключение запросов, фильтрация, роутинг",
        "Разработка и интеграция админ-панели с расчетом gas fees, комиссией и работой с протоколами токенов в DeFi",
        "Подключение кошельков Web3 (Metamask, TW)",
        "Обработка нескольких протоколов с серверными данными",
        "Ликвидность пулов AMM / Цена LP"
      ],
      "technologiesUsed": [
        "JavaScript",
        "TypeScript",
        "Vue.js",
        "CoreUI",
        "Vuex",
        "Web3",
        "Ether.js",
        "Git",
        "HTML",
        "CSS",
        "Prettier",
        "ESLint"
      ]
    },
    {
      "name": "NDA",
      "description": "Приложение для логистики грузоперевозок по Северной Америке",
      "duration": "10.2022 - 08.2023 (10 месяцев)",
      "role": "Разработчик",
      "duties": [
        "Реализация новых функций веб-приложения",
        "Исправление ошибок",
        "Анализ всего продукта в целом с последующим предложением",
        "Улучшений самого продукта и процесса разработки",
        "Код-ревью внутри команды",
        "Внедрение юнит-тестов"
      ],
      "technologiesUsed": [
        "VueJS",
        "Nuxt",
        "Typescript",
        "Vite",
        "Vitest",
        "SASS",
        "HTML",
        "Babel",
        "ESlint",
        "Figma",
        "NPM",
        "Gitlab/Gitlab CI",
        "PCI DSS"
      ]
    },
    {
      "name": "NDA",
      "description": "Внутренняя админ-панель для сотрудников M.Video",
      "duration": "03.2021 - 10.2022 (10 месяцев)",
      "role": "Разработчик",
      "duties": [
        "Ревью код коллег",
        "Настраивал Gitlab CI",
        "Настройка и добавление компонентов в Storybook",
        "Оптимизация производительности интерфейса для быстрой загрузки и отзывчивости",
        "Создание новых интерактивных элементов, таких как формы, модальные окна",
        "Разработка новых разделов админки",
        "Написание SSR части приложения",
        "Создание новых компонентов с нуля из Figma",
      ],
      "technologiesUsed": [
        "VueJS",
        "Nuxt",
        "Typescript",
        "Webpack",
        "SCSS",
        "HTML",
        "Babel",
        "ESlint",
        "Figma",
        "Yarn",
        "Handlebars"
      ]
    },
    {
      "name": "NDA",
      "description": "Контентно-ориентированное CMS",
      "duration": "01.2020 - 03.2021 (1 год 2 месяца)",
      "role": "Разработчик",
      "duties": [
        "Внедрение и наглядная демонстрация улучшения прогнозируемости работы команды",
        "Рaзpaбoткa новых разделов CMS, разработка UI-kit'a",
        "Написание SSR части приложения",
        "Создание сложнейших таблиц с нуля",
        "Внедрение практики написания unit- и e2e-тестов",
        "Разработка и формализация методики оценки задач",
      ],
      "technologiesUsed": [
        "VueJS 2",
        "AngularJS",
        "Typescript",
        "Webpack",
        "CSS",
        "HTML",
        "ESlint",
        "Figma",
        "NPM",
        "Gitlab/Gitlab CI",
        "Babel"
      ]
    },
    {
      "name": "NDA",
      "description": "Проект ERP для ресторанов Северной Америки",
      "duration": "07.2017 - 01.2020 (2 год 6 месяцев)",
      "role": "Разработчик",
      "duties": [
        "Самостоятельная настройка Webpack",
        "Уменьшение размера бандла",
        "Рaзpaбoткa нового функционала, устранение имеющихся",
        "Настройка Webpack для проекта",
        "Построение компонентов на основе Kendo-UI+ VueJS",
        "Написание прокси-mock'aльщика backend'a",
        "Правка drag and Drop вычислений",
      ],
      "technologiesUsed": [
        "VueJS",
        "Kendo-UI",
        "JavaScript",
        "Webpack",
        "CSS",
        "HTML",
        "NPM"
      ]
    }
  ]
}